var qno = new Array;
var question = new Array;
var a1 = new Array;
var a2 = new Array;
var a3 = new Array;
var a4 = new Array;
var pic = new Array;
var ca = new Array;
var randomnumber;
var selected = new Array;
var selectedans = new Array;
var ansstatus = new Array;
var curr_idx = 0;
var g_check = 0;
var c_count = 0;
var question_no = 1;
var theno = 10;
function changeValue() {
	document.getElementById("demo").innerHTML = sectomin(--value);
	if (value == 0) {
		stop();
		alert("Time's up");
	}
}

var timerInterval = null;
function start() {
	stop();
	value = 1200;
	if (value != 0)
		timerInterval = setInterval(changeValue, 1000);
}
var stop = function () {
	clearInterval(timerInterval);
}

function sectomin(time) {
	return Math.floor(time / 60) + ":" + ("00" + (time % 60).toString()).slice(-2);

}
function hide_button() {
	if (question_no == 20) {
		$("#next").html("Submit");
	}
	else {
		$("#next").show();
		$("#next").html("Next");
	}

	if (question_no == 1)
		$("#back").hide();
	else
		$("#back").show();
}

function check() {
	alert($('input[name=selector]:checked', '#questionbox').val());
	alert("question no: " + question_no + " " + selected[question_no - 1]);
};
function fuck() {
	alert("fuck");
}
function abc() {
	if (selectedans[question_no - 1] != undefined)
		$("#" + selectedans[question_no - 1]).prop('checked', true);
	else {
		$("#1").prop('checked', false);
		$("#2").prop('checked', false);
		$("#3").prop('checked', false);
		$("#4").prop('checked', false);
	}
}
function next() {
	//document.getElementById("question").innerHTML = "k";

	$("#qtable").hide();
	if (question_no != 20)
		$("#qno").html(++question_no + "." + ansstatus[question_no - 1]);
	else {
		checkanswer();
		if (c_count >= 16)
			alert("Pass " + c_count + "/20");
		else
			alert("Fail " + c_count + "/20");
	}
	hide_button();
	setq(selected[question_no - 1]);
	$("#qtable").show();

}
function timer() {

}
function checkanswer() {
	c_count = 0;
	for (var xxx = 0; xxx < 20; ++xxx) {
		if (selectedans[xxx] == ca[selected[xxx]])
		{
			++c_count;
			ansstatus[xxx] = "Correct";
		}
		else
		{
			ansstatus[xxx] = "Wrong";
		}
	}
}

function previous() {
	//document.getElementById("question").innerHTML = "k";
	$("#qtable").hide();
	if (question_no != 1) {
		//document.getElementById("qno").innerHTML = --question_no + ".";
		$("#qno").html(--question_no + "." + ansstatus[question_no - 1]);
	}
	hide_button();
	setq(selected[question_no - 1]);
	$("#qtable").show();
}
//first function to called
function generate() {
	init();
	print_question();
	startInterval();
	//document.write (question[0]);
}
function to20() {
	$("#demo").html("20:00");
	$("#qno").html("1.")
	$("#back").hide();
	question_no = 1;
	$("#next").html("Next");
}
function hideall() {
	$('#1').hide();
	$('#2').hide();
	$('#3').hide();
	$('#4').hide();
	$('#start').html("Start");
	$('#back').hide();
	$('#next').hide();
	$('#check').hide();
	$('#roadsign').hide();
	$('#qno').hide();

}
function pad(width, string, padding) {
	return (width <= string.length) ? string : pad(width, string + padding, padding)
}
function setq(theno) {
	if (pic[theno] == "1") {
		$("#roadsign").show();
		$("#roadsign").attr("src", "signs/" + (theno + 1) + ".jpg")
	}
	else
		$("#roadsign").hide();
	//change label value

	$("#question").html(question[theno]);
	//document.getElementById("question").innerHTML = question[theno];
	$('label[for=1]').html(pad(35, a1[theno] + " ", "　"));
	$('label[for=2]').html(pad(35, a2[theno] + " ", "　"));
	if (a1[theno] == "")
		$('#1').hide();
	else
		$('#1').show();
	if (a2[theno] == "")
		$('#2').hide();
	else
		$('#2').show();

	if (a3[theno] == "")
		$('label[for=3]').hide();
	else {
		$('label[for=3]').html(pad(35, a3[theno] + " ", "　"));
		$('label[for=3]').show();
	}

	if (a4[theno] == "") {
		$('label[for=4]').hide();
	}
	else {
		$('label[for=4]').show();
		$('label[for=4]').html(pad(35, a4[theno] + " ", "　"));
	}
	abc();
}
function ran() {
	return Math.floor(Math.random() * 379);
}

//init. the question and answer array
function init() {
	for (var local_idxx = 0; local_idxx < 20; local_idxx++) {
		selected[local_idxx] = ran();
		ansstatus[local_idxx] = "";
	}
	$("input[type='radio']").click(function () {
		var previousValue = $(this).attr('previousValue');
		var name = $(this).attr('name');

		if (previousValue == 'checked') {
			$(this).removeAttr('checked');
			$(this).attr('previousValue', false);
		}
		else {
			$("input[name=" + name + "]:radio").attr('previousValue', false);
			$(this).attr('previousValue', 'checked');
		}
	});

	$('#roadsign').show();
	$('#next').show();
	$('#start').html("Reset");
	$('#stop').hide();
	$('#qno').show();

	qno[0] = "1001";
	question[0] = "右面圖形代表…";
	a1[0] = "前面修路";
	a2[0] = "前面有其它危險";
	a3[0] = "交通燈在前";
	a4[0] = "";
	pic[0] = "1";
	ca[0] = "2";

	qno[1] = "1002";
	question[1] = "右面圖形代表…";
	a1[1] = "前面路滑";
	a2[1] = "車輛停泊處";
	a3[1] = "不淮過線";
	a4[1] = "";
	pic[1] = "1";
	ca[1] = "1";

	qno[2] = "1003";
	question[2] = "右面圖形代表…";
	a1[2] = "前面路面濕滑";
	a2[2] = "前面有鬆脫碎石";
	a3[2] = "提防爆胎";
	a4[2] = "";
	pic[2] = "1";
	ca[2] = "2";

	qno[3] = "1004";
	question[3] = "右面圖形代表…";
	a1[3] = "飛機場在前";
	a2[3] = "前面有低飛飛機，或突如其來的飛機噪音";
	a3[3] = "禁止放紙鳶";
	a4[3] = "";
	pic[3] = "1";
	ca[3] = "2";

	qno[4] = "1005";
	question[4] = "右面圖形代表…";
	a1[4] = "前面牛場";
	a2[4] = "前面路上有牛隻";
	a3[4] = "前面屠房";
	a4[4] = "";
	pic[4] = "1";
	ca[4] = "2";

	qno[5] = "1006";
	question[5] = "右面圖形代表…";
	a1[5] = "前面道路右邊收窄";
	a2[5] = "前面道路兩邊收窄";
	a3[5] = "右邊彎路";
	a4[5] = "";
	pic[5] = "1";
	ca[5] = "1";

	qno[6] = "1007";
	question[6] = "右面圖形代表…";
	a1[6] = "前面有單車";
	a2[6] = "單車專用線";
	a3[6] = "前面單車場";
	a4[6] = "";
	pic[6] = "1";
	ca[6] = "1";

	qno[7] = "1008";
	question[7] = "右面圖形代表…";
	a1[7] = "前面有行人過路線";
	a2[7] = "禁止行人過路";
	a3[7] = "行人天橋在前";
	a4[7] = "";
	pic[7] = "1";
	ca[7] = "1";

	qno[8] = "1009";
	question[8] = "右面圖形代表…";
	a1[8] = "前面交錯路口";
	a2[8] = "前面消防嚨頭";
	a3[8] = "前面只准直駛";
	a4[8] = "";
	pic[8] = "1";
	ca[8] = "1";

	qno[9] = "1010";
	question[9] = "右面圖形代表…";
	a1[9] = "雙程路終止";
	a2[9] = "前面雙程行車橫過單程行車路";
	a3[9] = "只准左轉或右轉";
	a4[9] = "";
	pic[9] = "1";
	ca[9] = "2";

	qno[10] = "1011";
	question[10] = "右面圖形代表…";
	a1[10] = "前面雙程行車";
	a2[10] = "單程路";
	a3[10] = "留意迎面車輛";
	a4[10] = "";
	pic[10] = "1";
	ca[10] = "1";

	qno[11] = "1012";
	question[11] = "右面圖形代表…";
	a1[11] = "前面左邊行車線封閉";
	a2[11] = "前面右邊行車線封閉";
	a3[11] = "右線只准巴士行駛";
	a4[11] = "";
	pic[11] = "1";
	ca[11] = "2";

	qno[12] = "1013";
	question[12] = "右面圖形代表…";
	a1[12] = "前面改入另一行車道";
	a2[12] = "前面連續彎路";
	a3[12] = "前面路面濕滑";
	a4[12] = "";
	pic[12] = "1";
	ca[12] = "1";

	qno[13] = "1014";
	question[13] = "右面圖形代表…";
	a1[13] = "前面交通燈號";
	a2[13] = "路口在前";
	a3[13] = "前面修路";
	a4[13] = "";
	pic[13] = "1";
	ca[13] = "1";

	qno[14] = "1015";
	question[14] = "右面圖形代表…";
	a1[14] = "前面向上斜坡";
	a2[14] = "前面向下斜坡";
	a3[14] = "前面斜坡";
	a4[14] = "";
	pic[14] = "1";
	ca[14] = "1";

	qno[15] = "1016";
	question[15] = "右面圖形代表…";
	a1[15] = "前面山坡";
	a2[15] = "前面路面不平";
	a3[15] = "前面路滑";
	a4[15] = "";
	pic[15] = "1";
	ca[15] = "2";

	qno[16] = "1017";
	question[16] = "右面圖形代表…";
	a1[16] = "前面有石塊下墜的危險";
	a2[16] = "前面山崖";
	a3[16] = "前面爆石";
	a4[16] = "";
	pic[16] = "1";
	ca[16] = "1";

	qno[17] = "1018";
	question[17] = "右面圖形代表…";
	a1[17] = "海灘在前";
	a2[17] = "前面岸邊或河邊";
	a3[17] = "懸崖在前";
	a4[17] = "";
	pic[17] = "1";
	ca[17] = "2";

	qno[18] = "1019";
	question[18] = "右面圖形代表…";
	a1[18] = "前面路上有行人";
	a2[18] = "小心兒童橫過馬路";
	a3[18] = "前面行人過路線";
	a4[18] = "";
	pic[18] = "1";
	ca[18] = "1";

	qno[19] = "1020";
	question[19] = "右面圖形代表…";
	a1[19] = "傷殘人上專用線";
	a2[19] = "前面有傷殘人士";
	a3[19] = "小心醫院在前";
	a4[19] = "";
	pic[19] = "1";
	ca[19] = "2";

	qno[20] = "1021";
	question[20] = "右面圖形代表…";
	a1[20] = "前面向下斜坡";
	a2[20] = "前面向上斜坡";
	a3[20] = "前面斜坡";
	a4[20] = "";
	pic[20] = "1";
	ca[20] = "1";

	qno[21] = "1022";
	question[21] = "右面圖形代表…";
	a1[21] = "前面T型路口";
	a2[21] = "前面十字路口";
	a3[21] = "留意左方車輛駛出";
	a4[21] = "";
	pic[21] = "1";
	ca[21] = "1";

	qno[22] = "1023";
	question[22] = "右面圖形代表…";
	a1[22] = "之字路";
	a2[22] = "前面先右轉連續彎路";
	a3[22] = "彎路在前";
	a4[22] = "";
	pic[22] = "1";
	ca[22] = "2";

	qno[23] = "1024";
	question[23] = "右面圖形代表…";
	a1[23] = "右邊彎路";
	a2[23] = "前面左彎";
	a3[23] = "連續彎路";
	a4[23] = "";
	pic[23] = "1";
	ca[23] = "2";

	qno[24] = "1025";
	question[24] = "右面圖形代表…";
	a1[24] = "道路行車終止";
	a2[24] = "前面道路兩邊收窄";
	a3[24] = "前面改為單線行車";
	a4[24] = "";
	pic[24] = "1";
	ca[24] = "2";

	qno[25] = "1026";
	question[25] = "右面圖形代表…";
	a1[25] = "向右轉";
	a2[25] = "前面迴旋處";
	a3[25] = "在前面掉頭";
	a4[25] = "";
	pic[25] = "1";
	ca[25] = "2";

	qno[26] = "1027";
	question[26] = "右面圖形代表…";
	a1[26] = "前面有道路工程";
	a2[26] = "前面地盆";
	a3[26] = "注意工人";
	a4[26] = "";
	pic[26] = "1";
	ca[26] = "1";

	qno[27] = "1028";
	question[27] = "右面圖形代表…";
	a1[27] = "前面馬場";
	a2[27] = "前面路上有馬匹";
	a3[27] = "禁止馬匹";
	a4[27] = "";
	pic[27] = "1";
	ca[27] = "2";

	qno[28] = "1029";
	question[28] = "右面圖形代表…";
	a1[28] = "電燈工程進行中";
	a2[28] = "前面有架空電纜";
	a3[28] = "連續彎路在前";
	a4[28] = "";
	pic[28] = "1";
	ca[28] = "2";

	qno[29] = "1030";
	question[29] = "右面圖形代表…";
	a1[29] = "前面有小路";
	a2[29] = "前面左邊有小路";
	a3[29] = "與右方車輛匯合";
	a4[29] = "";
	pic[29] = "1";
	ca[29] = "1";

	qno[30] = "1031";
	question[30] = "右面圖形代表…";
	a1[30] = "前面醫院";
	a2[30] = "前面十字路口";
	a3[30] = "前面教堂";
	a4[30] = "";
	pic[30] = "1";
	ca[30] = "2";

	qno[31] = "1032";
	question[31] = "右面圖形代表…";
	a1[31] = "前面有兒童";
	a2[31] = "學童候車處";
	a3[31] = "小心兒童玩耍";
	a4[31] = "";
	pic[31] = "1";
	ca[31] = "1";

	qno[32] = "1033";
	question[32] = "右面圖形代表…";
	a1[32] = "寬度限制";
	a2[32] = "車軸限制";
	a3[32] = "前面有高度限制";
	a4[32] = "";
	pic[32] = "1";
	ca[32] = "3";

	qno[33] = "1034";
	question[33] = "右面圖形代表…";
	a1[33] = "與右方車輛匯合";
	a2[33] = "與左方車輛匯合";
	a3[33] = "彎路在左";
	a4[33] = "";
	pic[33] = "1";
	ca[33] = "1";

	qno[34] = "1035";
	question[34] = "右面圖形代表…";
	a1[34] = "前面路口";
	a2[34] = "前面分隔車路終止";
	a3[34] = "前面分沿兩邊行駛";
	a4[34] = "";
	pic[34] = "1";
	ca[34] = "2";

	qno[35] = "1036";
	question[35] = "右面圖形代表…";
	a1[35] = "車軸限制";
	a2[35] = "車輛闊度限制";
	a3[35] = "禁止超過所示高度車輛駛入";
	a4[35] = "";
	pic[35] = "1";
	ca[35] = "3";

	qno[36] = "1037";
	question[36] = "右面圖形代表…";
	a1[36] = "分路至此終止";
	a2[36] = "前面有交錯路口";
	a3[36] = "左方車輛併入";
	a4[36] = "";
	pic[36] = "1";
	ca[36] = "3";

	qno[37] = "1038";
	question[37] = "右面圖形代表…";
	a1[37] = "向左轉";
	a2[37] = "靠右行駛";
	a3[37] = "靠左行駛";
	a4[37] = "";
	pic[37] = "1";
	ca[37] = "3";

	qno[38] = "1039";
	question[38] = "右面圖形代表…";
	a1[38] = "不准右轉";
	a2[38] = "不准左轉";
	a3[38] = "前面路口左轉";
	a4[38] = "";
	pic[38] = "1";
	ca[38] = "3";

	qno[39] = "1040";
	question[39] = "右面圖形代表…";
	a1[39] = "車輛可取道任何一邊到達同一目的地";
	a2[39] = "分路至此為止";
	a3[39] = "兩邊巴士專用線";
	a4[39] = "";
	pic[39] = "1";
	ca[39] = "1";

	qno[40] = "1041";
	question[40] = "右面圖形代表…";
	a1[40] = "前面單車場";
	a2[40] = "單車路，禁止機動車輛駛入";
	a3[40] = "禁止單車行駛";
	a4[40] = "";
	pic[40] = "1";
	ca[40] = "2";

	qno[41] = "1042";
	question[41] = "右面圖形代表…";
	a1[41] = "注意天橋在上";
	a2[41] = "留意高度限制";
	a3[41] = "只准向前駛";
	a4[41] = "";
	pic[41] = "1";
	ca[41] = "3";

	qno[42] = "1043";
	question[42] = "右面圖形代表…";
	a1[42] = "前面路口右轉";
	a2[42] = "前面左轉";
	a3[42] = "禁止直駛";
	a4[42] = "";
	pic[42] = "1";
	ca[42] = "1";

	qno[43] = "1044";
	question[43] = "右面圖形代表…";
	a1[43] = "右轉";
	a2[43] = "左轉";
	a3[43] = "只准向前駛";
	a4[43] = "";
	pic[43] = "1";
	ca[43] = "2";

	qno[44] = "1045";
	question[44] = "右面圖形代表…";
	a1[44] = "只准向前駛";
	a2[44] = "單程行車";
	a3[44] = "禁止向左或向右轉";
	a4[44] = "";
	pic[44] = "1";
	ca[44] = "2";

	qno[45] = "1046";
	question[45] = "右面圖形代表…";
	a1[45] = "不准右轉";
	a2[45] = "右轉";
	a3[45] = "不准左轉";
	a4[45] = "";
	pic[45] = "1";
	ca[45] = "2";

	qno[46] = "1047";
	question[46] = "右面圖形代表…";
	a1[46] = "前路有障礙物";
	a2[46] = "此路不通";
	a3[46] = "前面危險";
	a4[46] = "";
	pic[46] = "1";
	ca[46] = "2";

	qno[47] = "1048";
	question[47] = "右面圖形代表…";
	a1[47] = "預先警告，左邊道路不通";
	a2[47] = "左方支路有障礙物";
	a3[47] = "左方T字路";
	a4[47] = "";
	pic[47] = "1";
	ca[47] = "1";

	qno[48] = "1049";
	question[48] = "右面圖形代表…";
	a1[48] = "雙程路，只准巴士專用";
	a2[48] = "單程路，只准小巴行駛";
	a3[48] = "反向巴士線";
	a4[48] = "";
	pic[48] = "1";
	ca[48] = "3";

	qno[49] = "1050";
	question[49] = "右面圖形代表…";
	a1[49] = "讓車處Passing place";
	a2[49] = "只供私家車、小巴及小型貨車停泊";
	a3[49] = "警崗";
	a4[49] = "";
	pic[49] = "1";
	ca[49] = "2";

	qno[50] = "1051";
	question[50] = "右面圖形代表…";
	a1[50] = "巴士線";
	a2[50] = "不准巴士行駛";
	a3[50] = "重型車內線行駛";
	a4[50] = "";
	pic[50] = "1";
	ca[50] = "1";

	qno[51] = "1052";
	question[51] = "右面圖形代表…";
	a1[51] = "只准學車駛入";
	a2[51] = "禁止學習駕駛者駛入";
	a3[51] = "學習駕駛者專用路線";
	a4[51] = "";
	pic[51] = "1";
	ca[51] = "2";

	qno[52] = "1053";
	question[52] = "右面圖形代表…";
	a1[52] = "禁止左轉";
	a2[52] = "禁止直駛";
	a3[52] = "禁止右轉";
	a4[52] = "";
	pic[52] = "1";
	ca[52] = "1";

	qno[53] = "1054";
	question[53] = "右面圖形代表…";
	a1[53] = "禁止停車";
	a2[53] = "禁止泊車";
	a3[53] = "只准公共小型巴士停泊";
	a4[53] = "";
	pic[53] = "1";
	ca[53] = "1";

	qno[54] = "1055";
	question[54] = "右面圖形代表…";
	a1[54] = "前面左轉";
	a2[54] = "禁止掉頭";
	a3[54] = "禁止右轉";
	a4[54] = "";
	pic[54] = "1";
	ca[54] = "3";

	qno[55] = "1056";
	question[55] = "右面圖形代表…";
	a1[55] = "車身高度限制";
	a2[55] = "速度限制";
	a3[55] = "禁止超過所示闊度車輛駛入";
	a4[55] = "";
	pic[55] = "1";
	ca[55] = "3";

	qno[56] = "1057";
	question[56] = "右面圖形代表…";
	a1[56] = "只准兩公噸以上車輛駛入";
	a2[56] = "禁止兩公噸以上車輛駛入";
	a3[56] = "禁止超過所示車軸總負重量車輛駛入";
	a4[56] = "";
	pic[56] = "1";
	ca[56] = "3";

	qno[57] = "1058";
	question[57] = "右面圖形代表…";
	a1[57] = "最高車速";
	a2[57] = "行車速度限制終止";
	a3[57] = "行車速度要超過50公里";
	a4[57] = "";
	pic[57] = "1";
	ca[57] = "1";

	qno[58] = "1059";
	question[58] = "右面圖形代表…";
	a1[58] = "禁止超過所示長度的車輛或車輛組合駛入";
	a2[58] = "禁止車輛駛入";
	a3[58] = "禁止貨車駛入";
	a4[58] = "";
	pic[58] = "1";
	ca[58] = "1";

	qno[59] = "1060";
	question[59] = "右面圖形代表…";
	a1[59] = "禁止貨車駛入";
	a2[59] = "禁止小巴(公共小型巴士)駛入";
	a3[59] = "禁止專線小巴駛入";
	a4[59] = "";
	pic[59] = "1";
	ca[59] = "2";

	qno[60] = "1061";
	question[60] = "右面圖形代表…";
	a1[60] = "禁止載有危險物品的車輛駛入";
	a2[60] = "只准貨車駛入";
	a3[60] = "禁止泥頭車駛入";
	a4[60] = "";
	pic[60] = "1";
	ca[60] = "1";

	qno[61] = "1062";
	question[61] = "右面圖形代表…";
	a1[61] = "只准貨車駛入";
	a2[61] = "巴士專用線終止";
	a3[61] = "禁止巴士或豪華巴士駛入";
	a4[61] = "";
	pic[61] = "1";
	ca[61] = "3";

	qno[62] = "1063";
	question[62] = "右面圖形代表…";
	a1[62] = "只准貨車駛入";
	a2[62] = "禁止貨車駛入";
	a3[62] = "貨車專用線";
	a4[62] = "";
	pic[62] = "1";
	ca[62] = "2";

	qno[63] = "1064";
	question[63] = "右面圖形代表…";
	a1[63] = "只准專利巴士駛入";
	a2[63] = "禁止向左或向右轉";
	a3[63] = "禁止車輛駛入";
	a4[63] = "";
	pic[63] = "1";
	ca[63] = "3";

	qno[64] = "1065";
	question[64] = "右面圖形代表…";
	a1[64] = "前面有危險";
	a2[64] = "車輛必須在本標誌前停車";
	a3[64] = "前面有障礙物";
	a4[64] = "";
	pic[64] = "1";
	ca[64] = "2";

	qno[65] = "1066";
	question[65] = "右面圖形代表…";
	a1[65] = "只可左轉";
	a2[65] = "只可右轉";
	a3[65] = "禁止掉頭";
	a4[65] = "";
	pic[65] = "1";
	ca[65] = "3";

	qno[66] = "1067";
	question[66] = "右面圖形代表…";
	a1[66] = "禁止機動車輛駛入";
	a2[66] = "禁止單車駛入";
	a3[66] = "禁止私家車及電單車駛入";
	a4[66] = "";
	pic[66] = "1";
	ca[66] = "1";

	qno[67] = "1068";
	question[67] = "右面圖形代表…";
	a1[67] = "可以超車";
	a2[67] = "禁止超車";
	a3[67] = "只准單線行車";
	a4[67] = "";
	pic[67] = "1";
	ca[67] = "2";

	qno[68] = "1069";
	question[68] = "右面圖形代表…";
	a1[68] = "單車專用線";
	a2[68] = "行人專用線";
	a3[68] = "禁止行人及單車進入";
	a4[68] = "";
	pic[68] = "1";
	ca[68] = "3";

	qno[69] = "1070";
	question[69] = "右面圖形代表…";
	a1[69] = "禁止人力車及行人控制的車輛進入";
	a2[69] = "黃包車(車仔)專用線";
	a3[69] = "手推車專用線";
	a4[69] = "";
	pic[69] = "1";
	ca[69] = "1";

	qno[70] = "1071";
	question[70] = "右面圖形代表…";
	a1[70] = "小心行人橫過";
	a2[70] = "行人專用線";
	a3[70] = "行人止步";
	a4[70] = "";
	pic[70] = "1";
	ca[70] = "3";

	qno[71] = "1072";
	question[71] = "右面圖形代表…";
	a1[71] = "留心行人過路";
	a2[71] = "讓路給行人";
	a3[71] = "讓路給車輛";
	a4[71] = "";
	pic[71] = "1";
	ca[71] = "2";

	qno[72] = "1073";
	question[72] = "右面圖形代表…";
	a1[72] = "只准單車住入";
	a2[72] = "單車及行人專用";
	a3[72] = "禁止單車住入";
	a4[72] = "";
	pic[72] = "1";
	ca[72] = "3";

	qno[73] = "1074";
	question[73] = "右面圖形代表…";
	a1[73] = "禁止貨車駛入";
	a2[73] = "禁止超過所示總重量車輛駛入";
	a3[73] = "只准10公噸以上車輛駛入";
	a4[73] = "";
	pic[73] = "1";
	ca[73] = "2";

	qno[74] = "1075";
	question[74] = "右面圖形代表…";
	a1[74] = "禁止響號";
	a2[74] = "可以響號";
	a3[74] = "寂靜地帶終止";
	a4[74] = "";
	pic[74] = "1";
	ca[74] = "1";

	qno[75] = "1076";
	question[75] = "右面圖形代表…";
	a1[75] = "禁止車輛駛入";
	a2[75] = "單程路";
	a3[75] = "前面修路";
	a4[75] = "";
	pic[75] = "1";
	ca[75] = "1";

	qno[76] = "1077";
	question[76] = "右面圖形代表…";
	a1[76] = "禁止泊車";
	a2[76] = "禁止貨車駛入";
	a3[76] = "禁止巴士駛入";
	a4[76] = "";
	pic[76] = "1";
	ca[76] = "1";

	qno[77] = "1078";
	question[77] = "右面圖形代表…";
	a1[77] = "禁止車輛駛入";
	a2[77] = "前面要停車或讓路";
	a3[77] = "前面修路";
	a4[77] = "";
	pic[77] = "1";
	ca[77] = "2";

	qno[78] = "1079";
	question[78] = "右面圖形代表…";
	a1[78] = "前面燈號";
	a2[78] = "停車及讓路";
	a3[78] = "前面危險";
	a4[78] = "";
	pic[78] = "1";
	ca[78] = "2";

	qno[79] = "1080";
	question[79] = "右面圖形代表…";
	a1[79] = "留意左方巴士";
	a2[79] = "前面有巴士線";
	a3[79] = "巴士停泊處";
	a4[79] = "";
	pic[79] = "1";
	ca[79] = "2";

	qno[80] = "1081";
	question[80] = "右面圖形代表…";
	a1[80] = "前面大路有巴士線";
	a2[80] = "巴士停泊處";
	a3[80] = "巴士只准左轉";
	a4[80] = "";
	pic[80] = "1";
	ca[80] = "1";

	qno[81] = "1082";
	question[81] = "右面圖形代表…";
	a1[81] = "暫時禁止泊車";
	a2[81] = "禁止貨車上落貨物";
	a3[81] = "只准左右停泊車輛";
	a4[81] = "";
	pic[81] = "1";
	ca[81] = "1";

	qno[82] = "1083";
	question[82] = "右面圖形代表…";
	a1[82] = "行人路及單車路，禁止機動車輛駛入";
	a2[82] = "禁止行人及單車駛用";
	a3[82] = "只准單車行駛";
	a4[82] = "";
	pic[82] = "1";
	ca[82] = "1";

	qno[83] = "1084";
	question[83] = "右面圖形代表…";
	a1[83] = "將車輛停在黃方格內";
	a2[83] = "『黃色方格路口』除右轉外，在出口暢通無阻前，切勿駛進";
	a3[83] = "黃色方格路口禁止右轉";
	a4[83] = "";
	pic[83] = "1";
	ca[83] = "2";

	qno[84] = "1085";
	question[84] = "右面圖形代表…";
	a1[84] = "學校交通安全隊，車輛必須在本標誌前停車";
	a2[84] = "停車，牛群橫過馬路";
	a3[84] = "停車，前面火警";
	a4[84] = "";
	pic[84] = "1";
	ca[84] = "1";

	qno[85] = "1086";
	question[85] = "右面圖形代表…";
	a1[85] = "綠色小巴停泊處";
	a2[85] = "綠色小巴終站";
	a3[85] = "綠色小巴上落客區";
	a4[85] = "";
	pic[85] = "1";
	ca[85] = "2";

	qno[86] = "1087";
	question[86] = "右面圖形代表…";
	a1[86] = "表示有意駛往右邊或右轉 ";
	a2[86] = "表示有意駛往左邊或左轉";
	a3[86] = "表示有意慢駛或停車";
	a4[86] = "";
	pic[86] = "1";
	ca[86] = "1";

	qno[87] = "1088";
	question[87] = "右面圖形代表…";
	a1[87] = "表示有意駛往左邊或左轉";
	a2[87] = "我將要讓你超越(扒頭)";
	a3[87] = "表示有意慢駛或停車";
	a4[87] = "";
	pic[87] = "1";
	ca[87] = "1";

	qno[88] = "1089";
	question[88] = "右面圖形代表…";
	a1[88] = "我將要讓你超越(扒頭)";
	a2[88] = "表示有意慢駛或停車";
	a3[88] = "表示有意往右邊或右轉 ";
	a4[88] = "";
	pic[88] = "1";
	ca[88] = "2";

	qno[89] = "1090";
	question[89] = "右面圖形代表…";
	a1[89] = "表示有意駛往右邊或右轉 ";
	a2[89] = "表示有意駛往左邊或左轉";
	a3[89] = "表示有意慢駛或停車";
	a4[89] = "";
	pic[89] = "1";
	ca[89] = "2";

	qno[90] = "1091";
	question[90] = "右面圖形代表…";
	a1[90] = "表示有意駛往左邊或左轉";
	a2[90] = "表示有意駛往右邊或右轉 ";
	a3[90] = "表示有意慢駛或停車";
	a4[90] = "";
	pic[90] = "1";
	ca[90] = "2";

	qno[91] = "1092";
	question[91] = "右面圖形代表…";
	a1[91] = "表示有意慢駛或停車";
	a2[91] = "我將要讓你超越(扒頭)";
	a3[91] = "表示有意駛往左邊或左轉";
	a4[91] = "";
	pic[91] = "1";
	ca[91] = "1";

	qno[92] = "1093";
	question[92] = "此標誌表示道路出口距離的『倒數』多少米？";
	a1[92] = "距離道路出口一百米";
	a2[92] = "距離道路出口二百米";
	a3[92] = "距離道路出口三百米";
	a4[92] = "";
	pic[92] = "1";
	ca[92] = "3";

	qno[93] = "1094";
	question[93] = "右面圖形代表…";
	a1[93] = "前面有其他危險";
	a2[93] = "前面交通黑點";
	a3[93] = "前面迴旋處";
	a4[93] = "";
	pic[93] = "1";
	ca[93] = "2";

	qno[94] = "1095";
	question[94] = "此標誌表示道路出口距離的『倒數』多少米？";
	a1[94] = "距離道路出口五十米";
	a2[94] = "距離道路出口一百米";
	a3[94] = "距離道路出口一千米";
	a4[94] = "";
	pic[94] = "1";
	ca[94] = "2";

	qno[95] = "1096";
	question[95] = "右面圖形代表…";
	a1[95] = "行人天橋在前";
	a2[95] = "快速公路起點";
	a3[95] = "行車天橋在前";
	a4[95] = "";
	pic[95] = "1";
	ca[95] = "2";

	qno[96] = "1097";
	question[96] = "右面圖形代表…";
	a1[96] = "輕便鐵路車輛專用範圍";
	a2[96] = "電車中途站";
	a3[96] = "輕便鐵路中途站";
	a4[96] = "";
	pic[96] = "1";
	ca[96] = "1";

	qno[97] = "1098";
	question[97] = "右面圖形代表…";
	a1[97] = "前面有地下鐵路";
	a2[97] = "前面有輕便鐵路車輛";
	a3[97] = "小心輕便鐵路車輛";
	a4[97] = "";
	pic[97] = "1";
	ca[97] = "2";

	qno[98] = "1099";
	question[98] = "右面圖形代表…";
	a1[98] = "前面行人天橋封閉";
	a2[98] = "快速公路終點";
	a3[98] = "禁止泊車";
	a4[98] = "";
	pic[98] = "1";
	ca[98] = "2";

	qno[99] = "1100";
	question[99] = "右面圖形代表…";
	a1[99] = "車道中線";
	a2[99] = "危險警告線";
	a3[99] = "行車線劃線";
	a4[99] = "";
	pic[99] = "1";
	ca[99] = "1";

	qno[100] = "1101";
	question[100] = "右面圖形代表…";
	a1[100] = "匯合";
	a2[100] = "分叉";
	a3[100] = "雙程行車";
	a4[100] = "";
	pic[100] = "1";
	ca[100] = "2";

	qno[101] = "1102";
	question[101] = "右面圖形代表…";
	a1[101] = "在『停車』標誌牌前的停車線";
	a2[101] = "全日禁止泊車";
	a3[101] = "全日禁止停車";
	a4[101] = "";
	pic[101] = "1";
	ca[101] = "3";

	qno[102] = "1103";
	question[102] = "右面圖形代表…";
	a1[102] = "單車路，禁止機動車輛駛入";
	a2[102] = "禁止踏單車";
	a3[102] = "前面有單車";
	a4[102] = "";
	pic[102] = "1";
	ca[102] = "2";

	qno[103] = "1104";
	question[103] = "右面圖形代表…";
	a1[103] = "禁止踏單車區終止";
	a2[103] = "禁止單車駛入";
	a3[103] = "單車專用線";
	a4[103] = "";
	pic[103] = "1";
	ca[103] = "1";

	qno[104] = "1105";
	question[104] = "右面圖形代表…";
	a1[104] = "左轉";
	a2[104] = "邊路急轉向左";
	a3[104] = "前面路口左轉";
	a4[104] = "";
	pic[104] = "1";
	ca[104] = "2";

	qno[105] = "1106";
	question[105] = "停車距離是";
	a1[105] = "思考距離加上煞車距離";
	a2[105] = "思考距離";
	a3[105] = "煞車距離";
	a4[105] = "";
	pic[105] = "0";
	ca[105] = "1";

	qno[106] = "1107";
	question[106] = "駕駛車輛時有下列情況是違法的";
	a1[106] = "煞車掣不妥善";
	a2[106] = "吸煙或與乘客談話";
	a3[106] = "車窗全部關閉";
	a4[106] = "";
	pic[106] = "0";
	ca[106] = "1";

	qno[107] = "1108";
	question[107] = "車輛在正常情況下因緊急煞停車輛路面留下一條10米長的輪胎痕跡，表示該車當時的行車速度可能時時速";
	a1[107] = "20千米";
	a2[107] = "40千米";
	a3[107] = "60千米";
	a4[107] = "";
	pic[107] = "0";
	ca[107] = "2";

	qno[108] = "1109";
	question[108] = "車輛之行車證，應該";
	a1[108] = "貼在擋風玻璃右邊";
	a2[108] = "貼在擋風玻璃左邊";
	a3[108] = "放在駕駛者衣袋內";
	a4[108] = "";
	pic[108] = "0";
	ca[108] = "2";

	qno[109] = "1110";
	question[109] = "如無特別標誌，電單車市區內行駛時速限制是";
	a1[109] = "時速四十千米";
	a2[109] = "時速五十千米";
	a3[109] = "時速六十千米";
	a4[109] = "";
	pic[109] = "0";
	ca[109] = "2";

	qno[110] = "1111";
	question[110] = "右面圖形代表…";
	a1[110] = "路面凹凸不平";
	a2[110] = "機動車停泊處";
	a3[110] = "前面單車場";
	a4[110] = "";
	pic[110] = "1";
	ca[110] = "1";

	qno[111] = "1112";
	question[111] = "右面圖形代表…";
	a1[111] = "小心車輛高速";
	a2[111] = "小心行人";
	a3[111] = "車輛不可靠近路邊";
	a4[111] = "";
	pic[111] = "1";
	ca[111] = "2";

	qno[112] = "1113";
	question[112] = "右面圖形代表…";
	a1[112] = "與右方車輛併入(如屬非快速公路，標誌底色為藍色)(快速公路為綠色)";
	a2[112] = "雙程路，只准轉右";
	a3[112] = "留意右方車輛";
	a4[112] = "";
	pic[112] = "1";
	ca[112] = "1";

	qno[113] = "1114";
	question[113] = "右面圖形代表…";
	a1[113] = "只准電單車及機動三輪車駛入";
	a2[113] = "禁止電單車及機動三輪車駛入";
	a3[113] = "小心電單車切入";
	a4[113] = "";
	pic[113] = "1";
	ca[113] = "2";

	qno[114] = "1115";
	question[114] = "右面圖形代表…";
	a1[114] = "停車，私人屋村路禁止駛入";
	a2[114] = "小心學童過橫過斑馬線";
	a3[114] = "學校交通安全隊，車輛須在本標誌前停車";
	a4[114] = "";
	pic[114] = "1";
	ca[114] = "3";

	qno[115] = "1116";
	question[115] = "右面圖形代表…";
	a1[115] = "小心修路燈號";
	a2[115] = "前面有速度偵察器";
	a3[115] = "前面有偵察衝紅燈/超速攝影機";
	a4[115] = "";
	pic[115] = "1";
	ca[115] = "3";

	qno[116] = "1117";
	question[116] = "右面圖形代表…";
	a1[116] = "前面有輕便鐵路車輛專線";
	a2[116] = "前面有西北鐵路車輛或電車專線";
	a3[116] = "小心電單車切入";
	a4[116] = "";
	pic[116] = "1";
	ca[116] = "2";

	qno[117] = "1118";
	question[117] = "右面圖形代表…";
	a1[117] = "行人徑及供多輪車使用的道路，禁止汽車駛入";
	a2[117] = "只准行人及多輪車使用的道路";
	a3[117] = "行人小心有多輪車駛入";
	a4[117] = "";
	pic[117] = "1";
	ca[117] = "1";

	qno[118] = "1119";
	question[118] = "右面圖形代表…";
	a1[118] = "禁止汽車駛入，電單車及機動三輪車除外";
	a2[118] = "車輛禁止停泊";
	a3[118] = "車輛行駛時嚴禁高速及轉向";
	a4[118] = "";
	pic[118] = "1";
	ca[118] = "1";

	qno[119] = "1120";
	question[119] = "右面圖形代表…";
	a1[119] = "左方車輛併入(如屬非快速公路，標誌底色為藍色)(快速公路為綠色)";
	a2[119] = "雙程路，只准轉左";
	a3[119] = "留意左方車輛";
	a4[119] = "";
	pic[119] = "1";
	ca[119] = "1";

	qno[120] = "1121";
	question[120] = "右面圖形代表…";
	a1[120] = "在出口暢通無阻前切勿駛進";
	a2[120] = "將車輛停在黃方格內";
	a3[120] = "黃方格內車輛不准停泊";
	a4[120] = "";
	pic[120] = "1";
	ca[120] = "1";

	qno[121] = "1122";
	question[121] = "右面圖形代表…";
	a1[121] = "不准多輪車駛入";
	a2[121] = "小心多輛車駛入";
	a3[121] = "供多輛車使用的道路或場地，禁止汽車駛入";
	a4[121] = "";
	pic[121] = "1";
	ca[121] = "3";

	qno[122] = "1123";
	question[122] = "法律規定駕駛時必須遵從下列人士所發出之交通訊號或手號...";
	a1[122] = "當值警員";
	a2[122] = "任何路上行人";
	a3[122] = "任何人士";
	a4[122] = "";
	pic[122] = "0";
	ca[122] = "1";

	qno[123] = "1124";
	question[123] = "靜寂地帶是…";
	a1[123] = "行車速度限制不超過時速50千米的任何道路";
	a2[123] = "任何住宅地區";
	a3[123] = "醫院地帶";
	a4[123] = "";
	pic[123] = "0";
	ca[123] = "1";

	qno[124] = "1125";
	question[124] = "停泊汽車離開後有下列情形是違法？";
	a1[124] = "窗沒有關止";
	a2[124] = "引擎仍然開動";
	a3[124] = "車匙遺留車內";
	a4[124] = "";
	pic[124] = "0";
	ca[124] = "2";

	qno[125] = "1126";
	question[125] = "沿斜坡下駛時，你應該…";
	a1[125] = "用力踏下腳掣";
	a2[125] = "使用低速排檔(波)行駛";
	a3[125] = "使用高速排檔(波)行駛";
	a4[125] = "";
	pic[125] = "0";
	ca[125] = "2";

	qno[126] = "1127";
	question[126] = "駕駛者見到『停車！兒童要橫過馬路』標誌時，應該…";
	a1[126] = "如果路上沒有兒童則不一定需要停車";
	a2[126] = "不論路上有沒有兒童都必須立即停車";
	a3[126] = "號示意你要前駛";
	a4[126] = "";
	pic[126] = "0";
	ca[126] = "2";

	qno[127] = "1128";
	question[127] = "下列情形是不合法的：";
	a1[127] = "車前擋風玻璃不貼上行車證";
	a2[127] = "在繁忙的路上慢駛";
	a3[127] = "前車發出訊號叫你超越(扒頭)你不遵從";
	a4[127] = "";
	pic[127] = "0";
	ca[127] = "1";

	qno[128] = "1129";
	question[128] = "停泊汽車離開後，讓引擎繼續開動是…";
	a1[128] = "危險的";
	a2[128] = "安全的";
	a3[128] = "合法的";
	a4[128] = "";
	pic[128] = "0";
	ca[128] = "1";

	qno[129] = "1130";
	question[129] = "超越(扒頭)是沒有危險的如果…";
	a1[129] = "沒有尾隨車輛";
	a2[129] = "看清楚前面沒有障礙";
	a3[129] = "你的車速夠快就隨時可以超越(扒頭)";
	a4[129] = "";
	pic[129] = "0";
	ca[129] = "2";

	qno[130] = "1131";
	question[130] = "當交通外發生而導致有人受傷時…";
	a1[130] = "你必須向警方報案";
	a2[130] = "如傷者傷勢不嚴重則只須駛往醫院求助";
	a3[130] = "雙方不追究責任，便不須要報案";
	a4[130] = "";
	pic[130] = "0";
	ca[130] = "1";

	qno[131] = "1132";
	question[131] = "見有人站在路中手執牌示上面寫『停車！兒童要橫過馬路』你將會…";
	a1[131] = "響號，繼續向前慢駛";
	a2[131] = "停車";
	a3[131] = "如人並不是穿著制服則可繼續前駛";
	a4[131] = "";
	pic[131] = "0";
	ca[131] = "2";

	qno[132] = "1133";
	question[132] = "交通燈號亮著紅色，下一個是什麼顏色的燈號？";
	a1[132] = "黃色";
	a2[132] = "紅黃二色";
	a3[132] = "綠色";
	a4[132] = "";
	pic[132] = "0";
	ca[132] = "2";

	qno[133] = "1134";
	question[133] = "在那些路上不准停車？";
	a1[133] = "市區街道";
	a2[133] = "任何地方必要時是可以的";
	a3[133] = "指明為『禁止停車』之道路";
	a4[133] = "";
	pic[133] = "0";
	ca[133] = "3";

	qno[134] = "1135";
	question[134] = "交通意外有人受傷或財物受損時，駕駛者…";
	a1[134] = "必須立即停車";
	a2[134] = "不必停車，但須有暇時通知警方";
	a3[134] = "必須立即送傷者到醫院";
	a4[134] = "";
	pic[134] = "0";
	ca[134] = "1";

	qno[135] = "1136";
	question[135] = "除緊急情況外，欲快速安全地煞停一輛以時速50千米行駛中的車輛，可以…";
	a1[135] = "先踏腳掣，再踏離合器(極力子)踏板";
	a2[135] = "先踏離合器(極力子)踏板，再踏腳掣";
	a3[135] = "立即拉上手掣";
	a4[135] = "";
	pic[135] = "0";
	ca[135] = "1";

	qno[136] = "1137";
	question[136] = "駛過十字路口時，你應該…";
	a1[136] = "認為自己有優先權而直駛";
	a2[136] = "認為自己沒有優先權而小心行駛";
	a3[136] = "可慢速向前駛";
	a4[136] = "";
	pic[136] = "0";
	ca[136] = "2";

	qno[137] = "1138";
	question[137] = "如果遺失駕駛執照時，你應該…";
	a1[137] = "立即前往附近警署報案";
	a2[137] = "等待到期換領執照時，然後中請補領";
	a3[137] = "72小時內向警方報案";
	a4[137] = "";
	pic[137] = "0";
	ca[137] = "1";

	qno[138] = "1139";
	question[138] = "如果燈號是黃色，下一個燈號是什麼顏色？";
	a1[138] = "綠色";
	a2[138] = "紅黃二色";
	a3[138] = "紅色";
	a4[138] = "";
	pic[138] = "0";
	ca[138] = "3";

	qno[139] = "1140";
	question[139] = "一個優良的駕駛者，在轉彎前必先…";
	a1[139] = "轉用一波";
	a2[139] = "踏下離合器踏板";
	a3[139] = "改用低排檔(波)";
	a4[139] = "";
	pic[139] = "0";
	ca[139] = "3";

	qno[140] = "1141";
	question[140] = "當在晚間行車時，受迎面車輛的高燈影響時，你應該…";
	a1[140] = "響號通知迎面車輛之駕駛者";
	a2[140] = "亮著高燈向前直駛";
	a3[140] = "不要凝視，將車輛靠左邊慢駛或如有必要隨時準備停車";
	a4[140] = "";
	pic[140] = "0";
	ca[140] = "3";

	qno[141] = "1142";
	question[141] = "在斜坡的高處等待交通燈放行時，你應該…";
	a1[141] = "關閉引擎";
	a2[141] = "拉起手掣，入空波";
	a3[141] = "入二波";
	a4[141] = "";
	pic[141] = "0";
	ca[141] = "2";

	qno[142] = "1143";
	question[142] = "使用『高燈』晚間駛近斜坡最高處的時候，你會…";
	a1[142] = "改用『低燈』";
	a2[142] = "改用『細燈』";
	a3[142] = "繼續使用『高燈』";
	a4[142] = "";
	pic[142] = "0";
	ca[142] = "1";

	qno[143] = "1144";
	question[143] = "車輛在日落後及天亮前行駛，必須在…";
	a1[143] = "車輛前後每邊亮起一盞紅燈";
	a2[143] = "車後亮起一盞白燈";
	a3[143] = "車前亮起兩盞白燈和車後亮起兩盞紅燈";
	a4[143] = "";
	pic[143] = "0";
	ca[143] = "3";

	qno[144] = "1145";
	question[144] = "學習駕駛私家車必須有下列人士同在車內…";
	a1[144] = "任何持有有效駕駛執照人士";
	a2[144] = "合格之駕駛教師";
	a3[144] = "持有駕駛執照超過五年的人士";
	a4[144] = "";
	pic[144] = "0";
	ca[144] = "2";

	qno[145] = "1146";
	question[145] = "欲駛過十字路口時，紅色交通燈放亮，你必須…";
	a1[145] = "停車等待燈號轉綠色後再開行";
	a2[145] = "慢車及響號，如果前路無障礙則可前駛";
	a3[145] = "停車，如果前路無障礙則可前駛";
	a4[145] = "";
	pic[145] = "0";
	ca[145] = "1";

	qno[146] = "1147";
	question[146] = "駛達路口時交通燈亮起黃色，你應該…";
	a1[146] = "慢車，並在路口停車線前停車";
	a2[146] = "慢速駛過路口";
	a3[146] = "響號並加速駛過路口";
	a4[146] = "";
	pic[146] = "0";
	ca[146] = "1";

	qno[147] = "1148";
	question[147] = "紅色交通燈號放亮時，車輛可依照下列同時放亮之燈號，向指定之方向行駛";
	a1[147] = "綠色箭形燈號";
	a2[147] = "黃色燈號";
	a3[147] = "綠色燈號";
	a4[147] = "";
	pic[147] = "0";
	ca[147] = "1";

	qno[148] = "1149";
	question[148] = "你可將車輛停泊在…";
	a1[148] = "空的計程車(的士)停泊處";
	a2[148] = "晚間巴士站上";
	a3[148] = "規定的車輛停泊處";
	a4[148] = "";
	pic[148] = "0";
	ca[148] = "3";

	qno[149] = "1150";
	question[149] = "駛近一個沒有設置安全島的電車站時，乘客正在上落電車，你將會……";
	a1[149] = "慢駛繼續前進";
	a2[149] = "加速前進駛離";
	a3[149] = "慢駛並在黃線前停車";
	a4[149] = "";
	pic[149] = "0";
	ca[149] = "3";

	qno[150] = "1151";
	question[150] = "駕駛電單車不應該載客，除非該乘客…";
	a1[150] = "配帶安全合規格之頭盔";
	a2[150] = "年齡不超過80歲";
	a3[150] = "持有學習駕駛執照";
	a4[150] = "";
	pic[150] = "0";
	ca[150] = "1";

	qno[151] = "1152";
	question[151] = "隧道內行駛時發覺車輛損壞，你應該…";
	a1[151] = "自行步出隧道，通知隧道人員";
	a2[151] = "利用隧道內之電話通知隧道當局";
	a3[151] = "停駛在一邊，下車找人修理";
	a4[151] = "";
	pic[151] = "0";
	ca[151] = "2";

	qno[152] = "1153";
	question[152] = "隧道內亮著閃動的黃色燈號表示…";
	a1[152] = "不准超越(扒頭)";
	a2[152] = "將車速減至每小時50千米以下直至安全為止";
	a3[152] = "立即停車";
	a4[152] = "";
	pic[152] = "0";
	ca[152] = "2";

	qno[153] = "1154";
	question[153] = "在晚上騎單車時應保持…";
	a1[153] = "車頭有一白照明燈，車尾有一紅燈及紅色反射鏡";
	a2[153] = "車頭有一白照明燈，車尾有一紅燈";
	a3[153] = "車頭有一白照明燈，車尾有一紅反射鏡";
	a4[153] = "";
	pic[153] = "0";
	ca[153] = "1";

	qno[154] = "1155";
	question[154] = "紅色交通燈號和綠色箭形燈號同時亮起，表示…";
	a1[154] = "向前直駛";
	a2[154] = "向箭頭指示之方向行駛";
	a3[154] = "停車";
	a4[154] = "";
	pic[154] = "0";
	ca[154] = "2";

	qno[155] = "1156";
	question[155] = "在劃有多條行車線的雙程路上，你應該…";
	a1[155] = "永遠保持在靠右邊的行車線上行駛";
	a2[155] = "只在超越(扒頭)或右轉時始使用右邊行車線";
	a3[155] = "任意轉線行駛";
	a4[155] = "";
	pic[155] = "0";
	ca[155] = "2";

	qno[156] = "1157";
	question[156] = "除只有標示外，市區內的行車速度限制是…";
	a1[156] = "50千米";
	a2[156] = "70千米";
	a3[156] = "30千米";
	a4[156] = "";
	pic[156] = "0";
	ca[156] = "1";

	qno[157] = "1158";
	question[157] = "盡可能讓你的乘客…";
	a1[157] = "在車輛的右邊上落";
	a2[157] = "在車輛的左邊上落";
	a3[157] = "上落自如";
	a4[157] = "";
	pic[157] = "0";
	ca[157] = "2";

	qno[158] = "1159";
	question[158] = "一位優良的駕駛人在正常的情況下是沒有把握在少過下列之距離煞停一輛以時速60千米行駛的車輛：";
	a1[158] = "25米";
	a2[158] = "35米";
	a3[158] = "55米";
	a4[158] = "";
	pic[158] = "0";
	ca[158] = "2";

	qno[159] = "1160";
	question[159] = "在路中心壞車時，你將會…";
	a1[159] = "立即致電相熟車房";
	a2[159] = "把車移放路邊然後找人修理";
	a3[159] = "任由車輛停放路中，然後找人修理";
	a4[159] = "";
	pic[159] = "0";
	ca[159] = "2";

	qno[160] = "1161";
	question[160] = "駕車下斜坡，駛近障礙物時，迎面有車輛駛來，你將會…";
	a1[160] = "讓迎面車輛先行通過";
	a2[160] = "加速繞過該障礙物";
	a3[160] = "響號警告迎面車輛";
	a4[160] = "";
	pic[160] = "0";
	ca[160] = "1";

	qno[161] = "1162";
	question[161] = "行有天橋及斑馬線範圍內，行人應遵守在下列＿＿必須使用行人天橋或斑馬線橫過馬路";
	a1[161] = "25米";
	a2[161] = "15米";
	a3[161] = "10米";
	a4[161] = "";
	pic[161] = "0";
	ca[161] = "2";

	qno[162] = "1163";
	question[162] = "行人在沒有行人路的道路上行走應靠…";
	a1[162] = "左邊";
	a2[162] = "任何一邊都可以";
	a3[162] = "右邊";
	a4[162] = "";
	pic[162] = "0";
	ca[162] = "3";

	qno[163] = "1164";
	question[163] = "車輛停泊在同一停車處超過＿＿是違法的";
	a1[163] = "24小時";
	a2[163] = "48小時";
	a3[163] = "12小時";
	a4[163] = "";
	pic[163] = "0";
	ca[163] = "1";

	qno[164] = "1165";
	question[164] = "通常情況下，右線是讓…";
	a1[164] = "扒頭時使用 ";
	a2[164] = "較慢車輛行駛";
	a3[164] = "跑車行駛";
	a4[164] = "";
	pic[164] = "0";
	ca[164] = "1";

	qno[165] = "1166";
	question[165] = "所有交通時速限制是表示";
	a1[165] = "最高行車速度";
	a2[165] = "安全行車速度";
	a3[165] = "合理行車速度";
	a4[165] = "";
	pic[165] = "0";
	ca[165] = "1";

	qno[166] = "1167";
	question[166] = "駕駛中型貨車，重型貨車及貨櫃拖卡車等，駕駛時應該…";
	a1[166] = "靠左行駛";
	a2[166] = "靠右行駛";
	a3[166] = "並無限制";
	a4[166] = "";
	pic[166] = "0";
	ca[166] = "1";

	qno[167] = "1168";
	question[167] = "除私家車，輕型貨車及電單車駕駛執照外，要幾多歲才可以學習駕駛所有其他車輛？";
	a1[167] = "19歲";
	a2[167] = "20歲";
	a3[167] = "21歲";
	a4[167] = "";
	pic[167] = "0";
	ca[167] = "3";

	qno[168] = "1169";
	question[168] = "消防局門前亮起兩盞紅色閃燈表示：";
	a1[168] = "有消防車駛出";
	a2[168] = "有消防車駛入";
	a3[168] = "消防局內有意外";
	a4[168] = "";
	pic[168] = "0";
	ca[168] = "1";

	qno[169] = "1170";
	question[169] = "隧道內設有雙白線行車，前面交通阻塞，你應該…";
	a1[169] = "在本線停留不動";
	a2[169] = "安全情況下可以轉線 ";
	a3[169] = "下車查看原因";
	a4[169] = "";
	pic[169] = "0";
	ca[169] = "1";

	qno[170] = "1171";
	question[170] = "鼓勵使用低燈行車的目的是…";
	a1[170] = "避免迷亂迎面之駕駛者及其他道路使用者之視線";
	a2[170] = "要照出路面情況";
	a3[170] = "節省電力";
	a4[170] = "";
	pic[170] = "0";
	ca[170] = "1";

	qno[171] = "1172";
	question[171] = "設有行人過路線的地方，行人可以…";
	a1[171] = "離開該線10米內橫過馬路";
	a2[171] = "離開該線15米內橫過馬路";
	a3[171] = "只在該線上橫過馬路";
	a4[171] = "";
	pic[171] = "0";
	ca[171] = "3";

	qno[172] = "1173";
	question[172] = "如果給你超越(扒頭)的車輛突然加速行駛，你應該…";
	a1[172] = "響號及加高行車速度以超越它(扒頭)";
	a2[172] = "慢車墮後跟著它";
	a3[172] = "與該車並排行駛，直至其墮後為止";
	a4[172] = "";
	pic[172] = "0";
	ca[172] = "2";

	qno[173] = "1174";
	question[173] = "規定停泊車輛的地方是…";
	a1[173] = "任何郊區道路";
	a2[173] = "有標誌和白線指示的地方 ";
	a3[173] = "任何橫街";
	a4[173] = "";
	pic[173] = "0";
	ca[173] = "2";

	qno[174] = "1175";
	question[174] = "駕車時有下列情形就是違法：";
	a1[174] = "受到酒精或藥物影響 ";
	a2[174] = "手上執著一支燃燒著的香煙";
	a3[174] = "與乘客交談";
	a4[174] = "";
	pic[174] = "0";
	ca[174] = "1";

	qno[175] = "1176";
	question[175] = "當駛經路口的停車白線時，交通燈號由綠色轉為黃色，你將會...";
	a1[175] = "立即加速駛過";
	a2[175] = "將車退後，停在路口停車白線的後面";
	a3[175] = "繼續小心駛過路口";
	a4[175] = "";
	pic[175] = "0";
	ca[175] = "3";

	qno[176] = "1177";
	question[176] = "退後行車時，後面視線受到阻礙，你將會…";
	a1[176] = "響號並繼續退後慢駛 ";
	a2[176] = "停車";
	a3[176] = "繼續退後行駛";
	a4[176] = "";
	pic[176] = "0";
	ca[176] = "2";

	qno[177] = "1178";
	question[177] = "駕駛者將車退後時應避免…";
	a1[177] = "從小路退入大路";
	a2[177] = "從大路退入小路";
	a3[177] = "在夜間進行";
	a4[177] = "";
	pic[177] = "0";
	ca[177] = "1";

	qno[178] = "1179";
	question[178] = "駕車跟隨一架行駛緩慢的車輛在劃有雙白線標記的道路行駛，你將會…";
	a1[178] = "響號及從速超越該車(扒頭)";
	a2[178] = "如前車司機打出手號示意則可超越(扒頭)";
	a3[178] = "不超越(扒頭)";
	a4[178] = "";
	pic[178] = "0";
	ca[178] = "3";

	qno[179] = "1180";
	question[179] = "駛近迴旋處時應該留意及讓路給那一方向而來的車輛？";
	a1[179] = "左方";
	a2[179] = "右方";
	a3[179] = "前方";
	a4[179] = "";
	pic[179] = "0";
	ca[179] = "2";

	qno[180] = "1181";
	question[180] = "聽到緊急車輛警號時必須…";
	a1[180] = "將車駛靠右方路邊";
	a2[180] = "讓路";
	a3[180] = "立即在道路中心停車";
	a4[180] = "";
	pic[180] = "0";
	ca[180] = "2";

	qno[181] = "1182";
	question[181] = "交通意外，微損車身但並無人畜受傷，駕駛者…";
	a1[181] = "必須報警";
	a2[181] = "只要互相記錄姓名，地址及情況後即可繼續行車";
	a3[181] = "必須將車輛駛離現場";
	a4[181] = "";
	pic[181] = "0";
	ca[181] = "2";

	qno[182] = "1183";
	question[182] = "道路中心的一條斷續白線是表示： ";
	a1[182] = "不論何時超越前車(扒頭)都是危險的";
	a2[182] = "前路如撫阻礙則可超越(扒頭)";
	a3[182] = "不准右轉入支路";
	a4[182] = "";
	pic[182] = "0";
	ca[182] = "2";

	qno[183] = "1184";
	question[183] = "你可以在下列那處地方超越另－車輛(扒頭)";
	a1[183] = "前面路上沒有障礙的地方";
	a2[183] = "轉角地方";
	a3[183] = "彎路";
	a4[183] = "";
	pic[183] = "0";
	ca[183] = "1";

	qno[184] = "1185";
	question[184] = "駕駛發出過量聲響的車輛在下列甚麼時間是違法的";
	a1[184] = "不論何時";
	a2[184] = "由晚上十－時至上午六時";
	a3[184] = "由上午九時至下午五時";
	a4[184] = "";
	pic[184] = "0";
	ca[184] = "1";

	qno[185] = "1186";
	question[185] = "交通意外而有人受傷應該在下列甚麼時間內通知警方(報案)？";
	a1[185] = "十二小時內";
	a2[185] = "廿四小時內";
	a3[185] = "四十八小時內";
	a4[185] = "";
	pic[185] = "0";
	ca[185] = "2";

	qno[186] = "1187";
	question[186] = "駕駛電單車正在亮著紅燈的交通燈前，甚麼情況下可以駛過…";
	a1[186] = "除非有當值警員指示";
	a2[186] = "任意駛過";
	a3[186] = "如無行人橫越則可駛過";
	a4[186] = "";
	pic[186] = "0";
	ca[186] = "1";

	qno[187] = "1188";
	question[187] = "法律規定申請學習駕駛最少要多少歲？";
	a1[187] = "17歲";
	a2[187] = "18歲";
	a3[187] = "19歲";
	a4[187] = "";
	pic[187] = "0";
	ca[187] = "2";

	qno[188] = "1189";
	question[188] = "當你駛近路口時，看見路口劃有兩行斷續白線，表示…";
	a1[188] = "停車";
	a2[188] = "慢駛讓路";
	a3[188] = "不准超越(扒頭）";
	a4[188] = "";
	pic[188] = "0";
	ca[188] = "2";

	qno[189] = "1190";
	question[189] = "在有多條行車線的道路上行駛時，如欲右轉，必須…";
	a1[189] = "預早靠右邊行駛";
	a2[189] = "預早靠左邊行駛";
	a3[189] = "保持原線向前直駛";
	a4[189] = "";
	pic[189] = "0";
	ca[189] = "1";

	qno[190] = "1191";
	question[190] = "讓車處是用來…";
	a1[190] = "停泊車輛的";
	a2[190] = "給慢行的車輛駛入讓路給後方較快的車輛先行";
	a3[190] = "給巴士停站";
	a4[190] = "";
	pic[190] = "0";
	ca[190] = "2";

	qno[191] = "1192";
	question[191] = "駕車駛近路口時，發覺交通燈亮起黃燈時就應該";
	a1[191] = "";
	a2[191] = "";
	a3[191] = "";
	a4[191] = "";
	pic[191] = "0";
	ca[191] = "2";

	qno[192] = "1193";
	question[192] = "法律規定、駕駛者日間必須能夠在下列距離，看清楚車牌上之號碼(可以配帶眼鏡)";
	a1[192] = "30米";
	a2[192] = "23米";
	a3[192] = "20米";
	a4[192] = "";
	pic[192] = "0";
	ca[192] = "2";

	qno[193] = "1194";
	question[193] = "兒童單獨在馬路上騎單車，必須年滿…";
	a1[193] = "十歲";
	a2[193] = "十一歲";
	a3[193] = "十二歲";
	a4[193] = "";
	pic[193] = "0";
	ca[193] = "2";

	qno[194] = "1195";
	question[194] = "馬路上劃有雙白線而內有斜自線(影子線)是表示...";
	a1[194] = "車輛可以在影子線區域停車等候";
	a2[194] = "車輛可以在影子線區域之內停泊";
	a3[194] = "切勿橫越駛過影子線";
	a4[194] = "";
	pic[194] = "0";
	ca[194] = "3";

	qno[195] = "1196";
	question[195] = "法律規定命令式的交通標誌是…";
	a1[195] = "禁制性或強制性的交通資料";
	a2[195] = "一般指導性的資料";
	a3[195] = "所有交通資料";
	a4[195] = "";
	pic[195] = "0";
	ca[195] = "1";

	qno[196] = "1197";
	question[196] = "隧道內亮起閃動的黃燈是表示…";
	a1[196] = "立即停車";
	a2[196] = "危險性的訊號";
	a3[196] = "行車線將會封閉";
	a4[196] = "";
	pic[196] = "0";
	ca[196] = "1";

	qno[197] = "1198";
	question[197] = "電單車之車頭燈，在何種情形之下使用？";
	a1[197] = "任何時間包括日間視野清晰時使用";
	a2[197] = "晚間使用";
	a3[197] = "天色暗時使用 ";
	a4[197] = "";
	pic[197] = "0";
	ca[197] = "1";

	qno[198] = "1199";
	question[198] = "如果你看見前車發出『右轉』訊號時，你將會…";
	a1[198] = "加速從左方超越(扒頭)";
	a2[198] = "減低行車速度";
	a3[198] = "在前車右邊超越(扒頭)";
	a4[198] = "";
	pic[198] = "0";
	ca[198] = "2";

	qno[199] = "1200";
	question[199] = "駕駛執照如有損毀或持有人更改地址，必須在下列之時間內通知運輸署長…";
	a1[199] = "四十八小時內";
	a2[199] = "七十二小時內";
	a3[199] = "二十四小時內";
	a4[199] = "";
	pic[199] = "0";
	ca[199] = "2";

	qno[200] = "1201";
	question[200] = "在行人路渠邊髹有斷續黃色標記表示…";
	a1[200] = "不准貨車停泊";
	a2[200] = "不准泊車";
	a3[200] = "黃色方格在前";
	a4[200] = "";
	pic[200] = "0";
	ca[200] = "2";

	qno[201] = "1202";
	question[201] = "駕駛電單車在下列甚麼情形之下是『違法』的";
	a1[201] = "衝紅燈";
	a2[201] = "車速太慢";
	a3[201] = "遵從輔警指示";
	a4[201] = "";
	pic[201] = "0";
	ca[201] = "1";

	qno[202] = "1203";
	question[202] = "在道路上旁邊劃有兩條黃線表示…";
	a1[202] = "全日禁止停車";
	a2[202] = "只准貨車上落";
	a3[202] = "除繁忙時間外可以停車";
	a4[202] = "";
	pic[202] = "0";
	ca[202] = "1";

	qno[203] = "1204";
	question[203] = "當你駛近路口時，看見路口劃有兩行白線，你應該…";
	a1[203] = "停車";
	a2[203] = "慢駛讓路";
	a3[203] = "在前面不超越(扒頭)";
	a4[203] = "";
	pic[203] = "0";
	ca[203] = "1";

	qno[204] = "1205";
	question[204] = "電單車後座乘客之年歲最少是幾歲？ ";
	a1[204] = "五歲";
	a2[204] = "七歲";
	a3[204] = "八歲";
	a4[204] = "";
	pic[204] = "0";
	ca[204] = "3";

	qno[205] = "1206";
	question[205] = "禁制性的交通標誌顏色是…";
	a1[205] = "藍色";
	a2[205] = "紅色";
	a3[205] = "黃色";
	a4[205] = "";
	pic[205] = "0";
	ca[205] = "2";

	qno[206] = "1207";
	question[206] = "強制性的交通標誌顏色是…";
	a1[206] = "藍色";
	a2[206] = "紅色";
	a3[206] = "黃色";
	a4[206] = "";
	pic[206] = "0";
	ca[206] = "1";

	qno[207] = "1208";
	question[207] = "圓形的交通標誌是表示…";
	a1[207] = "警告";
	a2[207] = "命令";
	a3[207] = "指示";
	a4[207] = "";
	pic[207] = "0";
	ca[207] = "2";

	qno[208] = "1209";
	question[208] = "三角形的交通標誌是表示…";
	a1[208] = "警告";
	a2[208] = "命令";
	a3[208] = "指示";
	a4[208] = "";
	pic[208] = "0";
	ca[208] = "1";

	qno[209] = "1210";
	question[209] = "在道路上遇著有牲畜之時應該要…";
	a1[209] = "減低行車速度慢駛";
	a2[209] = "按響號驅散";
	a3[209] = "不理會牠";
	a4[209] = "";
	pic[209] = "0";
	ca[209] = "1";

	qno[210] = "1211";
	question[210] = "駕駛者在日間遇著滂沱大雨或大霧時…";
	a1[210] = "使用高燈";
	a2[210] = "使用低燈";
	a3[210] = "使用危險警告燈";
	a4[210] = "";
	pic[210] = "0";
	ca[210] = "2";

	qno[211] = "1212";
	question[211] = "大型貨車倒後時應該…";
	a1[211] = "請人幫忙或停車";
	a2[211] = "響號";
	a3[211] = "";
	a4[211] = "";
	pic[211] = "0";
	ca[211] = "1";

	qno[212] = "1213";
	question[212] = "持有臨時駕駛執照者學習駕駛電單車時是否可以載客？";
	a1[212] = "不可以";
	a2[212] = "乘客攜有合格的頭盔可載 ";
	a3[212] = "";
	a4[212] = "";
	pic[212] = "0";
	ca[212] = "1";

	qno[213] = "1214";
	question[213] = "行人輔助線之行人過路燈亮著紅色，下一個燈號是甚麼顏色？";
	a1[213] = "綠色";
	a2[213] = "紅及綠兩色";
	a3[213] = "黃色";
	a4[213] = "";
	pic[213] = "0";
	ca[213] = "1";

	qno[214] = "1215";
	question[214] = "道路上劃有兩條連續白線靠近本身連續白線表示…";
	a1[214] = "安全之下可以扒頭";
	a2[214] = "不可以扒頭";
	a3[214] = "前車司機手號示意叫扒頭";
	a4[214] = "";
	pic[214] = "0";
	ca[214] = "2";

	qno[215] = "1216";
	question[215] = "斑馬線前管制區甚麼情形之下可以超越扒頭？";
	a1[215] = "當時無行人";
	a2[215] = "前面有貨車";
	a3[215] = "有警員指示";
	a4[215] = "";
	pic[215] = "0";
	ca[215] = "3";

	qno[216] = "1217";
	question[216] = "3個3歲以上而不高於多少米的小童，可作兩名乘客計…";
	a1[216] = "1.3米 ";
	a2[216] = "1.4米 ";
	a3[216] = "1.5米 ";
	a4[216] = "";
	pic[216] = "0";
	ca[216] = "1";

	qno[217] = "1218";
	question[217] = "在進行某項行動包括(開車，掉頭，泊位/前，應記…";
	a1[217] = "想一想，看一看，發訊號，再看看";
	a2[217] = "看一看，發訊號，想一想，再看看";
	a3[217] = "看一看，想一想，再看看，發訊號";
	a4[217] = "";
	pic[217] = "0";
	ca[217] = "1";

	qno[218] = "1219";
	question[218] = "駕駛車身長度或連接車身長度超過多少米的車輛尾部應有標記…";
	a1[218] = "13米 ";
	a2[218] = "14米 ";
	a3[218] = "15米 ";
	a4[218] = "";
	pic[218] = "0";
	ca[218] = "1";

	qno[219] = "1220";
	question[219] = "在向上斜坡停泊車輛時，應將?盤扭向那方，並拉手掣入一波…";
	a1[219] = "左方";
	a2[219] = "右方";
	a3[219] = "";
	a4[219] = "";
	pic[219] = "0";
	ca[219] = "2";

	qno[220] = "1221";
	question[220] = "在向上斜坡而沒有行人路的道路上把汽車泊於左方，你應將?盤扭向那方？";
	a1[220] = "右方";
	a2[220] = "左方";
	a3[220] = "中間";
	a4[220] = "";
	pic[220] = "0";
	ca[220] = "2";

	qno[221] = "1222";
	question[221] = "在向下斜坡停泊車輛時，應將?盤扭向那方，並且拉緊手掣入後波…";
	a1[221] = "左方";
	a2[221] = "右方";
	a3[221] = "";
	a4[221] = "";
	pic[221] = "0";
	ca[221] = "1";

	qno[222] = "1223";
	question[222] = "在道路邊髹有虛白線或實線表示：";
	a1[222] = "禁止停車";
	a2[222] = "泊車";
	a3[222] = "駕車人士看";
	a4[222] = "";
	pic[222] = "0";
	ca[222] = "3";

	qno[223] = "1224";
	question[223] = "在甚麼情形之下車輛可以在左方扒頭：";
	a1[223] = "左轉";
	a2[223] = "向前直駛";
	a3[223] = "單程路";
	a4[223] = "";
	pic[223] = "0";
	ca[223] = "3";

	qno[224] = "1225";
	question[224] = "當你想左轉時迎面有一車輛想轉入同一條路時應怎樣？";
	a1[224] = "響號";
	a2[224] = "你有優先權駛入";
	a3[224] = "想一想，然後響號";
	a4[224] = "";
	pic[224] = "0";
	ca[224] = "2";

	qno[225] = "1226";
	question[225] = "當你駕車橫過大路時應該：";
	a1[225] = "先看左再看右";
	a2[225] = "先看右然後看左再看右";
	a3[225] = "先看右";
	a4[225] = "";
	pic[225] = "0";
	ca[225] = "2";

	qno[226] = "1227";
	question[226] = "甚麼情形之下會影響煞車距離？";
	a1[226] = "車胎及煞車性能欠佳";
	a2[226] = "視野不清晰";
	a3[226] = "反應較慢";
	a4[226] = "";
	pic[226] = "0";
	ca[226] = "1";

	qno[227] = "1228";
	question[227] = "隧道區域範圍內亮著紅色交叉燈表示：";
	a1[227] = "將車速減至時速50千米以下行駛";
	a2[227] = " 將車速減至時速30千米以下行駛";
	a3[227] = "停車，切勿繼續沿此線前進";
	a4[227] = "";
	pic[227] = "0";
	ca[227] = "3";

	qno[228] = "1229";
	question[228] = "在載有貨物時，貨物伸懸於車外，應在貨物最後部份掛上一面不少於多少米的紅旗讓人察覺…";
	a1[228] = "1平方米";
	a2[228] = "2平方米";
	a3[228] = "3平方米";
	a4[228] = "";
	pic[228] = "0";
	ca[228] = "1";

	qno[229] = "1230";
	question[229] = "行車時必須佩帶安全帶，如毋需佩帶安全帶，除非…";
	a1[229] = "每小時不超過10千米的時速";
	a2[229] = "落斜坡時";
	a3[229] = "三手?掉頭或泊位時";
	a4[229] = "";
	pic[229] = "0";
	ca[229] = "3";

	qno[230] = "1231";
	question[230] = "在以下何種情況下，可毋需佩帶安全帶…";
	a1[230] = "緩慢行車";
	a2[230] = "行車時速不超過10千米";
	a3[230] = "運輸署長批准";
	a4[230] = "";
	pic[230] = "0";
	ca[230] = "3";

	qno[231] = "1232";
	question[231] = "在一條單線雙程行車道上，如迎面有車輛駛至，而避車處在你的另一邊，你應…";
	a1[231] = "駛入避車處";
	a2[231] = "在避車處對面停車";
	a3[231] = "繼續向前直駛 ";
	a4[231] = "";
	pic[231] = "0";
	ca[231] = "2";

	qno[232] = "1233";
	question[232] = "車與車之間保持之跟車距離為…";
	a1[232] = "4秒";
	a2[232] = "6秒";
	a3[232] = "2秒";
	a4[232] = "";
	pic[232] = "0";
	ca[232] = "3";

	qno[233] = "1234";
	question[233] = "當路面濕滑時，判斷煞車距離應該要…";
	a1[233] = "乾濕地一樣";
	a2[233] = "增加一倍 ";
	a3[233] = "增加二倍 ";
	a4[233] = "";
	pic[233] = "0";
	ca[233] = "2";

	qno[234] = "1235";
	question[234] = "前面雙白線甚麼情形之下可以超車扒頭：";
	a1[234] = "你須要駛過雙白線車身旁靠近實線，可以扒頭";
	a2[234] = "你須要駛過雙白線車身旁靠近虛線，可以扒頭";
	a3[234] = "預先駛入路肩";
	a4[234] = "";
	pic[234] = "0";
	ca[234] = "2";

	qno[235] = "1236";
	question[235] = "前面交通管制標誌表示什麼？";
	a1[235] = "前面有人手操作臨時『停/去』訊號";
	a2[235] = "前路受阻應該掉頭";
	a3[235] = "前路斑馬線";
	a4[235] = "";
	pic[235] = "0";
	ca[235] = "1";

	qno[236] = "1237";
	question[236] = "一架車駛過水浸街道後，應該測試…";
	a1[236] = "車胎及迫力性能";
	a2[236] = "試探離合器";
	a3[236] = "檢查車頭燈";
	a4[236] = "";
	pic[236] = "0";
	ca[236] = "1";

	qno[237] = "1238";
	question[237] = "甚麼情形之下增加思考距離？";
	a1[237] = "反隱慢 ";
	a2[237] = "路面濕滑";
	a3[237] = "車胎及煞車性能欠佳";
	a4[237] = "";
	pic[237] = "0";
	ca[237] = "1";

	qno[238] = "1239";
	question[238] = "何種情形下撻火會有危險？";
	a1[238] = "有醉酒乘客在車內";
	a2[238] = "在車箱內吸煙";
	a3[238] = "燃油箱蓋打開";
	a4[238] = "";
	pic[238] = "0";
	ca[238] = "3";

	qno[239] = "1240";
	question[239] = "在正常情形下隧道內之車速不能低於：";
	a1[239] = "20千米";
	a2[239] = "30千米";
	a3[239] = "40千米";
	a4[239] = "";
	pic[239] = "0";
	ca[239] = "1";

	qno[240] = "1241";
	question[240] = "於下列情況下，在市區內可以響號：";
	a1[240] = "叫行人避開";
	a2[240] = "緊急及避免發生意外的時候";
	a3[240] = "當超越(扒頭)時";
	a4[240] = "";
	pic[240] = "0";
	ca[240] = "2";

	qno[241] = "1242";
	question[241] = "在快速公路上的路肩或路旁帶的作用是…";
	a1[241] = "超越";
	a2[241] = "停車等候";
	a3[241] = "發生緊急事故";
	a4[241] = "";
	pic[241] = "0";
	ca[241] = "3";

	qno[242] = "1243";
	question[242] = "在快速公路上駕駛者絕不可…";
	a1[242] = "減速";
	a2[242] = "倒車";
	a3[242] = "停車";
	a4[242] = "";
	pic[242] = "0";
	ca[242] = "2";

	qno[243] = "1244";
	question[243] = "車輛在移動時可否開亮危險警告燈號？";
	a1[243] = "可以開亮";
	a2[243] = "不可以開亮";
	a3[243] = "隨意開亮";
	a4[243] = "";
	pic[243] = "0";
	ca[243] = "2";

	qno[244] = "1245";
	question[244] = "車輛車尾停車燈號是甚麼顏色？";
	a1[244] = "白色";
	a2[244] = "紅色";
	a3[244] = "黃色 ";
	a4[244] = "";
	pic[244] = "0";
	ca[244] = "2";

	qno[245] = "1246";
	question[245] = "在隧道內行駛時，駕駛者絕不可使用…";
	a1[245] = "響號";
	a2[245] = "低燈";
	a3[245] = "收音機";
	a4[245] = "";
	pic[245] = "0";
	ca[245] = "1";

	qno[246] = "1247";
	question[246] = "在隧道區域內的綠色向下箭咀燈號是表示：";
	a1[246] = "在安全情況下，駕駛人士可繼續沿線向前駛";
	a2[246] = "危險訊號";
	a3[246] = "將車速減至時速50千米";
	a4[246] = "";
	pic[246] = "0";
	ca[246] = "1";

	qno[247] = "1248";
	question[247] = "如果壞車可能會阻塞交通，則駕駛人士應在路上下列距離放置一個三角形警告牌？";
	a1[247] = "30米";
	a2[247] = "40米";
	a3[247] = "50米";
	a4[247] = "";
	pic[247] = "0";
	ca[247] = "3";

	qno[248] = "1249";
	question[248] = "隧道內劃有雙白線，但前面車輛突然壞車，交通受到阻塞，你應該…";
	a1[248] = "在安全情況下才可超越";
	a2[248] = "遵守警務人員或隧道管理人員所發出的一切訊號";
	a3[248] = "保持原線";
	a4[248] = "";
	pic[248] = "0";
	ca[248] = "2";

	qno[249] = "1250";
	question[249] = "在道路上旁邊劃有單行黃色實線表示：";
	a1[249] = "全日禁止停車 ";
	a2[249] = "禁止停車 ";
	a3[249] = "在『時間標誌牌』所示時間內禁止停車";
	a4[249] = "";
	pic[249] = "0";
	ca[249] = "3";

	qno[250] = "1251";
	question[250] = "駕駛者遇到紅、黃兩色交通燈同時放亮時，應該…";
	a1[250] = "向前繼續行駛以迎合燈號轉綠色";
	a2[250] = "停車不動，並準備在燈號轉綠後開行 ";
	a3[250] = "加速通過";
	a4[250] = "";
	pic[250] = "0";
	ca[250] = "2";

	qno[251] = "1252";
	question[251] = "不遵從學校交通安全隊指示停車讓學生橫過馬路，將會被記…";
	a1[251] = "3分";
	a2[251] = "5分";
	a3[251] = "10分";
	a4[251] = "";
	pic[251] = "0";
	ca[251] = "1";

	qno[252] = "1253";
	question[252] = "巴上，中型及重型貨車的最高車速限制為時速";
	a1[252] = "70公里";
	a2[252] = "100公里";
	a3[252] = "當時道路上所准許的最高時速限制";
	a4[252] = "";
	pic[252] = "0";
	ca[252] = "1";

	qno[253] = "1254";
	question[253] = "駕駛違例記分制實施後，在兩年內被記分達＿＿或以上，便可被取消駕駛資格。";
	a1[253] = "10分";
	a2[253] = "15分";
	a3[253] = "20分";
	a4[253] = "";
	pic[253] = "0";
	ca[253] = "2";

	qno[254] = "1255";
	question[254] = "酒後駕駛者血液內的法定酒精限度為…";
	a1[254] = "每100毫升血液內含50毫克酒精";
	a2[254] = "每100毫升血液內含107毫克酒精";
	a3[254] = "每100毫升血液內含80微克酒精 ";
	a4[254] = "";
	pic[254] = "0";
	ca[254] = "1";

	qno[255] = "1256";
	question[255] = "如有需要駕駛者應該在甚麼時候打出手號？";
	a1[255] = "轉波的時候";
	a2[255] = "將車減慢行駛的時候";
	a3[255] = "緊急煞車的時候";
	a4[255] = "";
	pic[255] = "0";
	ca[255] = "2";

	qno[256] = "1257";
	question[256] = "車輛擁有權轉移，應在下列甚麼時間內通知運輸處？";
	a1[256] = "二十四小時內 24 hours";
	a2[256] = "七十二小時內 72 hours";
	a3[256] = "七天內 7 days";
	a4[256] = "";
	pic[256] = "0";
	ca[256] = "2";

	qno[257] = "1258";
	question[257] = "那一種滑胎(跣胎)是最危險？";
	a1[257] = "前輪滑胎";
	a2[257] = "後輪滑胎";
	a3[257] = "不論任何滑胎皆有危險";
	a4[257] = "";
	pic[257] = "0";
	ca[257] = "3";

	qno[258] = "1259";
	question[258] = "路旁劃有單行黃色虛線表示…";
	a1[258] = "全日禁止泊車";
	a2[258] = "部份時間不准停車";
	a3[258] = "全日禁止停車";
	a4[258] = "";
	pic[258] = "0";
	ca[258] = "1";

	qno[259] = "1260";
	question[259] = "車輛輪胎的胎紋必須佔胎面四份之三的闊度而深度不得少於…";
	a1[259] = "1毫米";
	a2[259] = "5毫米";
	a3[259] = "1厘米";
	a4[259] = "";
	pic[259] = "0";
	ca[259] = "1";

	qno[260] = "1261";
	question[260] = "駕駛人仕駛近班馬線前有什麼是不應做的？";
	a1[260] = "慢車及停車讓行人過路";
	a2[260] = "發訊號通知後面車輛停車";
	a3[260] = "示意行人過路";
	a4[260] = "";
	pic[260] = "0";
	ca[260] = "3";

	qno[261] = "1262";
	question[261] = "在快速公路上駕駛者絕不可…";
	a1[261] = "使用高燈";
	a2[261] = "掉頭";
	a3[261] = "超車";
	a4[261] = "";
	pic[261] = "0";
	ca[261] = "2";

	qno[262] = "1263";
	question[262] = "法例規定，七十歲以上人士…";
	a1[262] = "不得領取駕駛執照";
	a2[262] = "可以領取駕駛執照";
	a3[262] = "必須證明其健康及視力良好才可領取駕駛執照";
	a4[262] = "";
	pic[262] = "0";
	ca[262] = "3";

	qno[263] = "1264";
	question[263] = "駕駛違例記分制中列明，假如在＿＿內記滿15分或以上，駕駛人士需要停牌。";
	a1[263] = "12個月";
	a2[263] = "24個月";
	a3[263] = "36個月";
	a4[263] = "";
	pic[263] = "0";
	ca[263] = "2";

	qno[264] = "1265";
	question[264] = "駕駛車速比規定越過30公里而少於45公里，將會被記…";
	a1[264] = "5分";
	a2[264] = "8分";
	a3[264] = "10分";
	a4[264] = "";
	pic[264] = "0";
	ca[264] = "1";

	qno[265] = "1266";
	question[265] = "駕駛人士將會被記3分，如果車速比規定超過： ";
	a1[265] = "10公里";
	a2[265] = "15公里";
	a3[265] = "30公里";
	a4[265] = "";
	pic[265] = "0";
	ca[265] = "2";

	qno[266] = "1267";
	question[266] = "在酒精或藥物影響下駕駛車輛，違例所記分數是…";
	a1[266] = "8分";
	a2[266] = "10分";
	a3[266] = "15分";
	a4[266] = "";
	pic[266] = "0";
	ca[266] = "2";

	qno[267] = "1268";
	question[267] = "任何車輛之引擎汽缸容量低於＿＿，不准使用快速公路。";
	a1[267] = "125立方厘米";
	a2[267] = "250立方厘米";
	a3[267] = "350立方厘米";
	a4[267] = "";
	pic[267] = "0";
	ca[267] = "1";

	qno[268] = "1269";
	question[268] = "法例修訂，在96年6月1日或以後登記的私家車，下列那個座位必須裝有認可的安全帶。";
	a1[268] = "前座司機及乘客座位";
	a2[268] = "後座乘客座位";
	a3[268] = "上述所有座位";
	a4[268] = "";
	pic[268] = "0";
	ca[268] = "3";

	qno[269] = "1270";
	question[269] = "如在分隔車路或車速較快的道路上壞車，則需於＿＿前放置一個三角形警告牌。";
	a1[269] = "50米";
	a2[269] = "100米";
	a3[269] = "150米";
	a4[269] = "";
	pic[269] = "0";
	ca[269] = "2";

	qno[270] = "1271";
	question[270] = "在甚麼情況下，可以橫越雙白線？";
	a1[270] = "超越前面慢駛車輛 ";
	a2[270] = "以便駛入旁邊路口";
	a3[270] = "用以分隔相同方向的行車線";
	a4[270] = "";
	pic[270] = "0";
	ca[270] = "2";

	qno[271] = "1272";
	question[271] = "除擭特別批准外，那類駕駛者不可使用快速公路？";
	a1[271] = "巴士駕駛者";
	a2[271] = "學習駕駛者";
	a3[271] = "電單車駕駛者";
	a4[271] = "";
	pic[271] = "0";
	ca[271] = "2";

	qno[272] = "1273";
	question[272] = "在斑馬線處不讓行人先過馬路，將會被記…";
	a1[272] = "3分";
	a2[272] = "5分";
	a3[272] = "10分";
	a4[272] = "";
	pic[272] = "0";
	ca[272] = "1";

	qno[273] = "1274";
	question[273] = "法定規定，甚麼車輛不可使用快速公路之右線？";
	a1[273] = "私家車";
	a2[273] = "巴士";
	a3[273] = "跑車";
	a4[273] = "";
	pic[273] = "0";
	ca[273] = "2";

	qno[274] = "1275";
	question[274] = "發生意外後未有即時停車，將會被記…";
	a1[274] = "3分";
	a2[274] = "5分";
	a3[274] = "10分";
	a4[274] = "";
	pic[274] = "0";
	ca[274] = "2";

	qno[275] = "1276";
	question[275] = "不可駕駛有以下載貨情形的車輛，從地面計起，貨物高度超過＿＿。";
	a1[275] = "4.4米";
	a2[275] = "4.5米";
	a3[275] = "4.6米";
	a4[275] = "";
	pic[275] = "0";
	ca[275] = "3";

	qno[276] = "1277";
	question[276] = "不可駕駛有以下載貨情形的車輛，如貨物闊度超過＿＿。";
	a1[276] = "2.3米";
	a2[276] = "2.4米";
	a3[276] = "2.5米";
	a4[276] = "";
	pic[276] = "0";
	ca[276] = "3";

	qno[277] = "1278";
	question[277] = "不可駕駛有以下載貨情形的車輛，如貨物伸出車前超過＿＿。";
	a1[277] = "1.3米";
	a2[277] = "1.4米";
	a3[277] = "1.5米";
	a4[277] = "";
	pic[277] = "0";
	ca[277] = "3";

	qno[278] = "1279";
	question[278] = "不可駕駛有以下載貨情形的車輛，如貨物伸出車後超過＿＿。";
	a1[278] = "1.3米";
	a2[278] = "1.4米";
	a3[278] = "1.5米";
	a4[278] = "";
	pic[278] = "0";
	ca[278] = "2";

	qno[279] = "1280";
	question[279] = "在一些主要主幹路部設有緊急電話，該電話直駁＿＿。";
	a1[279] = "路政署";
	a2[279] = "警署";
	a3[279] = "運輸署";
	a4[279] = "";
	pic[279] = "0";
	ca[279] = "2";

	qno[280] = "1281";
	question[280] = "任何駕駛者如被發現呼氣酒精含量超過法定限度，終會被起訴";
	a1[280] = "每100毫升呼氣內含35毫克酒精";
	a2[280] = "每100毫升呼氣內含107毫克酒精";
	a3[280] = "每100毫升呼氣內含22微克酒精";
	a4[280] = "每100毫升呼氣內含80毫克酒精";
	pic[280] = "0";
	ca[280] = "3";

	qno[281] = "1282";
	question[281] = "駕駛車輛在快速公路超越前車，你會在前車的＿＿越過。";
	a1[281] = "左方";
	a2[281] = "右方";
	a3[281] = "任何一邊";
	a4[281] = "";
	pic[281] = "0";
	ca[281] = "2";

	qno[282] = "1283";
	question[282] = "快速公路上，甚麼情況下可以駛進路旁路肩？ ";
	a1[282] = "超車";
	a2[282] = "壞車";
	a3[282] = "左面超越";
	a4[282] = "";
	pic[282] = "0";
	ca[282] = "2";

	qno[283] = "1284";
	question[283] = "壞車時用來警告其他人士的警告牌，應有＿＿色反光及螢光的表面。";
	a1[283] = "藍";
	a2[283] = "紅";
	a3[283] = "黃";
	a4[283] = "";
	pic[283] = "0";
	ca[283] = "2";

	qno[284] = "1285";
	question[284] = "在快速公路中途壞車，而沒法將車輛駛離行車道，你應該…";
	a1[284] = "用手推動車輛";
	a2[284] = "使用響號，警告其它駕駛者";
	a3[284] = "亮起危險警告燈，離開車輛站到安全地方等候幫助";
	a4[284] = "";
	pic[284] = "0";
	ca[284] = "3";

	qno[285] = "1286";
	question[285] = "用拖車繩或拖車鍊拖車，兩部車輛的距離不可超過";
	a1[285] = "4米";
	a2[285] = "4.5米";
	a3[285] = "5米";
	a4[285] = "";
	pic[285] = "0";
	ca[285] = "2";

	qno[286] = "1287";
	question[286] = "快速公路上，壞車應該停放在…";
	a1[286] = "任何位置";
	a2[286] = "右方路旁";
	a3[286] = "路旁路肩";
	a4[286] = "";
	pic[286] = "0";
	ca[286] = "3";

	qno[287] = "1288";
	question[287] = "那一種車輛可行駛巴士線？";
	a1[287] = "電單車";
	a2[287] = "貨車";
	a3[287] = "單車";
	a4[287] = "";
	pic[287] = "0";
	ca[287] = "3";

	qno[288] = "1289";
	question[288] = "當踏單車時，不可按響車鈴示意其他道路使用者，除非…";
	a1[288] = "騎單車者不能停車";
	a2[288] = "駛近路門";
	a3[288] = "突然停車";
	a4[288] = "";
	pic[288] = "0";
	ca[288] = "1";

	qno[289] = "1290";
	question[289] = "法例規定，車輛應備有何種有效的文件，才能在道路上行駛？ ";
	a1[289] = "有效之第三者保險";
	a2[289] = "有效之行車證";
	a3[289] = "以上兩種";
	a4[289] = "";
	pic[289] = "0";
	ca[289] = "3";

	qno[290] = "1291";
	question[290] = "在甚麼情況下，警方有權要求駕駛者進行呼氣酒精測試？";
	a1[290] = "涉及交通意外";
	a2[290] = "行車時違反交通規例";
	a3[290] = "上述兩項皆有機會";
	a4[290] = "";
	pic[290] = "0";
	ca[290] = "3";

	qno[291] = "1292";
	question[291] = "當交通燈亮起黃色燈號時，應在交通燈前停車，除非…";
	a1[291] = "接近泊車處";
	a2[291] = "接近避車處";
	a3[291] = "太接近行人過路線";
	a4[291] = "";
	pic[291] = "0";
	ca[291] = "3";

	qno[292] = "1293";
	question[292] = "綠色人像燈閃動時，表示…";
	a1[292] = "應在馬路邊的行人路上等侯";
	a2[292] = "可橫過馬路";
	a3[292] = "應趕快橫過馬路";
	a4[292] = "";
	pic[292] = "0";
	ca[292] = "1";

	qno[293] = "1294";
	question[293] = "發生意外後沒有提供詳情，將會被記…";
	a1[293] = "3分";
	a2[293] = "5分";
	a3[293] = "8分";
	a4[293] = "";
	pic[293] = "0";
	ca[293] = "1";

	qno[294] = "1295";
	question[294] = "違反快速公路規例之駕駛者，初犯最高可被判罰？";
	a1[294] = "罰款三千元及入獄兩個月";
	a2[294] = "罰款五千元及入獄三個月";
	a3[294] = "罰款七千元及入獄四個月";
	a4[294] = "";
	pic[294] = "0";
	ca[294] = "2";

	qno[295] = "1296";
	question[295] = "不遵從警務人員或交通督導員指示，將會被記…";
	a1[295] = "3分";
	a2[295] = "5分";
	a3[295] = "8分";
	a4[295] = "";
	pic[295] = "0";
	ca[295] = "1";

	qno[296] = "1297";
	question[296] = "不遵守交通燈號，將會被記…";
	a1[296] = "3分";
	a2[296] = "5分";
	a3[296] = "10分";
	a4[296] = "";
	pic[296] = "0";
	ca[296] = "1";

	qno[297] = "1298";
	question[297] = "不小心駕駛，將會被記…";
	a1[297] = "3分";
	a2[297] = "5分";
	a3[297] = "10分";
	a4[297] = "";
	pic[297] = "0";
	ca[297] = "2";

	qno[298] = "1299";
	question[298] = "在快速公路上壞車，應開亮…";
	a1[298] = "細燈";
	a2[298] = "霧燈";
	a3[298] = "危險警告燈";
	a4[298] = "";
	pic[298] = "0";
	ca[298] = "3";

	qno[299] = "1300";
	question[299] = "在快速公路駕駛時，除超越前車外，車輛靠＿＿行駛";
	a1[299] = "左線";
	a2[299] = "中線";
	a3[299] = "右線";
	a4[299] = "";
	pic[299] = "0";
	ca[299] = "1";

	qno[300] = "1301";
	question[300] = "私家車乘客若沒有佩戴安全帶，誰要負責任？";
	a1[300] = "司機";
	a2[300] = "乘客";
	a3[300] = "司機及乘客";
	a4[300] = "";
	pic[300] = "0";
	ca[300] = "3";

	qno[301] = "1302";
	question[301] = "越過雙白線，將會被記…";
	a1[301] = "3分";
	a2[301] = "5分";
	a3[301] = "10分";
	a4[301] = "";
	pic[301] = "0";
	ca[301] = "1";

	qno[302] = "1303";
	question[302] = "行車時，司機及乘客佩戴認可的汽車安全帶可以 ";
	a1[302] = "防止交通意外發生";
	a2[302] = "使發生交通意外時所引致的死亡或嚴動受傷的機會減半";
	a3[302] = "使司機及乘客不可輕易移動";
	a4[302] = "";
	pic[302] = "0";
	ca[302] = "2";

	qno[303] = "1304";
	question[303] = "法例規定所有私家車＿＿乘客必須佩戴車內裝設的安全帶。";
	a1[303] = "只須前座";
	a2[303] = "只須後座";
	a3[303] = "前座及後座";
	a4[303] = "";
	pic[303] = "0";
	ca[303] = "3";

	qno[304] = "1305";
	question[304] = "法例規定那類車輛的前及後座座位均必須裝設獲認可的安全帶？";
	a1[304] = "私家車";
	a2[304] = "的士";
	a3[304] = "貨車";
	a4[304] = "";
	pic[304] = "0";
	ca[304] = "1";

	qno[305] = "1306";
	question[305] = "酒後駕駛的最高刑罰為吊銷駕駛執照及……";
	a1[305] = "罰款$50,000及監禁3年";
	a2[305] = "罰款$25,000及監禁2年";
	a3[305] = "罰款$25,000及監禁3年";
	a4[305] = "罰款$25,000及監禁5年";
	pic[305] = "0";
	ca[305] = "3";

	qno[306] = "1307";
	question[306] = "法例規定＿＿的後座乘客必須佩戴車內已裝設的安全帶。";
	a1[306] = "的士";
	a2[306] = "貨車";
	a3[306] = "私家車";
	a4[306] = "";
	pic[306] = "0";
	ca[306] = "3";

	qno[307] = "1308";
	question[307] = "酒後駕駛會造成甚麼嚴重後果？";
	a1[307] = "行車時違反交通規例";
	a2[307] = "危害本身及他人的安全";
	a3[307] = "減低駕駛樂趣";
	a4[307] = "";
	pic[307] = "0";
	ca[307] = "2";

	qno[308] = "1309";
	question[308] = "的士、小巴及貨車司機的前座及前中座乘客如年滿＿＿歲或以上，必須負責確保自己已佩戴安全帶。";
	a1[308] = "11";
	a2[308] = "15";
	a3[308] = "18";
	a4[308] = "";
	pic[308] = "0";
	ca[308] = "2";

	qno[309] = "1310";
	question[309] = "酒精會嚴重影響駕駛者那方面的駕駛能力？";
	a1[309] = "高估自己的駕駛能力及錯誤判斷速度及距離";
	a2[309] = "導致視力模糊，影響反應及動作協調性";
	a3[309] = "上還兩項皆受影響 ";
	a4[309] = "";
	pic[309] = "0";
	ca[309] = "3";

	qno[310] = "1311";
	question[310] = "在甚麼情況下，司機可以無須佩戴安全帶？";
	a1[310] = "由司機自由選擇";
	a2[310] = "倒車或泊位時";
	a3[310] = "進入隧道範圍";
	a4[310] = "";
	pic[310] = "0";
	ca[310] = "2";

	qno[311] = "1312";
	question[311] = "飲酒後，酒精能在＿＿ 之內滲進血液，然後開始對腦部產生作用。";
	a1[311] = "數秒鐘";
	a2[311] = "數分鐘";
	a3[311] = "數小時";
	a4[311] = "";
	pic[311] = "0";
	ca[311] = "2";

	qno[312] = "1313";
	question[312] = "下列那種情況會對兒童乘客構成嚴重危險及觸犯法例？";
	a1[312] = "讓兒童佩戴或使用合適的安全帶或安全椅";
	a2[312] = "把兒童手抱或放在前座乘客的膝上";
	a3[312] = "讓兒童坐於後座座位上並使用或佩戴合適的安全帶裝置";
	a4[312] = "";
	pic[312] = "0";
	ca[312] = "2";

	qno[313] = "1314";
	question[313] = "飲酒多少便會超過法定的酒精限度？";
	a1[313] = "每個人吸收酒精的程度均有不同，因人而異";
	a2[313] = "最多不超過三杯啤酒";
	a3[313] = "如非連績飲用不同酒精濃度的飲料，應無問題";
	a4[313] = "";
	pic[313] = "0";
	ca[313] = "1";

	qno[314] = "1315";
	question[314] = "兒童乘坐汽車坐在甚麼位置最安全？";
	a1[314] = "前座坐位";
	a2[314] = "後座坐位";
	a3[314] = "手抱兒童放在膝上";
	a4[314] = "";
	pic[314] = "0";
	ca[314] = "2";

	qno[315] = "1316";
	question[315] = "在甚麼情況下，酒精滲進血液的速度將會加快？";
	a1[315] = "沒有進食便飲酒";
	a2[315] = "連續飲用不同濃度的含酒精飲料";
	a3[315] = "上述兩項情況皆是 ";
	a4[315] = "";
	pic[315] = "0";
	ca[315] = "3";

	qno[316] = "1317";
	question[316] = "下列那一項是正確的保養安全帶方法？ ";
	a1[316] = "確保沒有被車門夾著或被座位壓著";
	a2[316] = "經常檢查有否破損跡象，如殘舊或欠妥便應更換";
	a3[316] = "上述兩項情況皆是";
	a4[316] = "";
	pic[316] = "0";
	ca[316] = "3";

	qno[317] = "1318";
	question[317] = "如駕駛前曾經飲酒，駕駛者應選擇…";
	a1[317] = "車速比平時稍慢，仍然駕駛 ";
	a2[317] = "放棄親自駕駛，或使用公共交通工具";
	a3[317] = "加快行車速度以縮短駕駛時間";
	a4[317] = "";
	pic[317] = "0";
	ca[317] = "2";

	qno[318] = "1319";
	question[318] = "下列那一項不正確的佩戴安全帶方法方式，可能會於交通意外時引致更嚴重的身體傷害？ ";
	a1[318] = "因應個人的舒適，固定安全帶的長度以增加鬆動";
	a2[318] = "將斜帶橫過肩膊中間，緊貼胸前到鎖骨位置";
	a3[318] = "安全帶不可扭曲，佩戴要平順貼服";
	a4[318] = "";
	pic[318] = "0";
	ca[318] = "1";

	qno[319] = "1320";
	question[319] = "法例規定在1996年6月1日起幾多歲以上的兒童必須佩戴安全帶？";
	a1[319] = "1歲";
	a2[319] = "2歲";
	a3[319] = "3歲";
	a4[319] = "";
	pic[319] = "0";
	ca[319] = "2";

	qno[320] = "1321";
	question[320] = "由1996年6月1日起，車輛如裝有兒童安全帶，則＿＿歲或以下的兒童必須佩戴？";
	a1[320] = "1歲";
	a2[320] = "2歲";
	a3[320] = "3歲";
	a4[320] = "";
	pic[320] = "0";
	ca[320] = "2";

	qno[321] = "1322";
	question[321] = "酒後駕駛再犯者之刑罰為…";
	a1[321] = "記5分或監禁及罰款";
	a2[321] = "記10分亦可能會喪失駕駛資格";
	a3[321] = "吊銷駕駛執照兩年或以上";
	a4[321] = "";
	pic[321] = "0";
	ca[321] = "3";

	qno[322] = "1323";
	question[322] = "酒後駕車司機體內尿液含超過法定限度屬違法";
	a1[322] = "每100毫升尿液含80毫克酒精";
	a2[322] = "每100毫升尿液含107微克酒精";
	a3[322] = "每100毫升尿液含67毫克酒精";
	a4[322] = "每100毫升尿液含35毫克酒精 ";
	pic[322] = "0";
	ca[322] = "3";

	qno[323] = "1324";
	question[323] = "私家車後座乘客均需佩戴安全帶之法例在何時開始實施？";
	a1[323] = "1995年6月1日";
	a2[323] = "1996年5月1日";
	a3[323] = "1996年6月1日";
	a4[323] = "1996年7月1日";
	pic[323] = "0";
	ca[323] = "3";

	qno[324] = "1325";
	question[324] = "在＿＿或以後登記的私家車必須安裝前中座及後座的安至帶？";
	a1[324] = "1996年5月1日";
	a2[324] = "1996年6月1日";
	a3[324] = "1996年7月1日";
	a4[324] = "1995年6月1日";
	pic[324] = "0";
	ca[324] = "2";

	qno[325] = "1326";
	question[325] = "酒後駕駛者初犯之刑罰是…";
	a1[325] = "記5分或監禁及罰款";
	a2[325] = "記10分亦可能會喪失駕駛資格 ";
	a3[325] = "記10分吊銷駕駛執照兩年或以上";
	a4[325] = "";
	pic[325] = "0";
	ca[325] = "2";

	qno[326] = "1327";
	question[326] = "黃色方格路口在什麼情況下可以駛進或停留？";
	a1[326] = "巴士可以停下";
	a2[326] = "轉右可以駛進";
	a3[326] = "其他司機向你發出手號";
	a4[326] = "";
	pic[326] = "0";
	ca[326] = "2";

	qno[327] = "1328";
	question[327] = "駕駛其間準備左轉，右手應作向種手號？";
	a1[327] = "向上下擺動 ";
	a2[327] = "順時針方向轉動";
	a3[327] = "逆時針方向轉動";
	a4[327] = "";
	pic[327] = "0";
	ca[327] = "3";

	qno[328] = "1329";
	question[328] = "以下那一個不是雙白線的作用？";
	a1[328] = "在交通繁忙的街道上控制轉換行車線的車輛";
	a2[328] = "在單程路上指示行車方向";
	a3[328] = "分隔來往行駛的車輛避免路面出現混亂";
	a4[328] = "";
	pic[328] = "0";
	ca[328] = "2";

	qno[329] = "1330";
	question[329] = "在大雨或濃霧中駕駛車輛時，視線模糊不清怎辦？";
	a1[329] = "亮著危險警告燈";
	a2[329] = "亮著車頭燈(使用照明燈)";
	a3[329] = "間歇性發出響號";
	a4[329] = "";
	pic[329] = "0";
	ca[329] = "2";

	qno[330] = "1331";
	question[330] = "當你發生交通意外後，有什麼事你不可以做的？";
	a1[330] = "留守現場防止再發生意外";
	a2[330] = "向其他駕駛人仕發出報告";
	a3[330] = "把傷者搬離至空曠的地方";
	a4[330] = "報警發生交通意外";
	pic[330] = "0";
	ca[330] = "3";

	qno[331] = "1332";
	question[331] = "交通燈號亮著紅黃色下一個燈號是什麼顏色？";
	a1[331] = "黃色";
	a2[331] = "紅色";
	a3[331] = "綠色";
	a4[331] = "";
	pic[331] = "0";
	ca[331] = "3";

	qno[332] = "1333";
	question[332] = "駕駛人士在駕駛其間發覺疲倦應怎辦？";
	a1[332] = "聽聽輕音樂曲";
	a2[332] = "加快速度以到達目的地";
	a3[332] = "停車休息";
	a4[332] = "";
	pic[332] = "0";
	ca[332] = "3";

	qno[333] = "1334";
	question[333] = "當駕駛時發生交通意外並阻塞交通，你應該…";
	a1[333] = "亮著危險警告燈";
	a2[333] = "在車後打手號通知其他駕駛人士";
	a3[333] = "將車駛往路旁避免阻礙其他車輛";
	a4[333] = "";
	pic[333] = "0";
	ca[333] = "3";

	qno[334] = "1335";
	question[334] = "斑馬線前的『之』字線區是表示？";
	a1[334] = "司機要慢車或停車，讓行人橫過馬路";
	a2[334] = "不准超越(扒頭)";
	a3[334] = "加速前進駛離";
	a4[334] = "";
	pic[334] = "0";
	ca[334] = "1";

	qno[335] = "1336";
	question[335] = "在沒有停車標誌的路口，下列那項是正確？";
	a1[335] = "永遠保持在靠右邊的行車線上行駛";
	a2[335] = "右轉車輛先讓迎面車輛先行";
	a3[335] = "慢車，並在路口停車線前停車";
	a4[335] = "";
	pic[335] = "0";
	ca[335] = "2";

	qno[336] = "1337";
	question[336] = "駛過水浸的街道後，你要立即驗查？";
	a1[336] = "煞車系統";
	a2[336] = "車頭燈及全車照明系統";
	a3[336] = "引擎系統";
	a4[336] = "";
	pic[336] = "0";
	ca[336] = "1";

	qno[337] = "1338";
	question[337] = "在高速公路發生車輛故障，你應？";
	a1[337] = "盡速找拖車公司將壞車拖離現場";
	a2[337] = "衹需亮著危險警告燈";
	a3[337] = "將車駛往路旁避免阻礙其他車輛";
	a4[337] = "";
	pic[337] = "0";
	ca[337] = "2";

	qno[338] = "1339";
	question[338] = "持有學習駕駛執照者";
	a1[338] = "可以接受訓練駕駛 ";
	a2[338] = "可以教授他人駕駛";
	a3[338] = "可以單獨在指定道路上駕駛";
	a4[338] = "";
	pic[338] = "0";
	ca[338] = "1";

	qno[339] = "1340";
	question[339] = "隧道內正常行車時速限制是";
	a1[339] = "30千米";
	a2[339] = "40千米";
	a3[339] = "70千米";
	a4[339] = "";
	pic[339] = "0";
	ca[339] = "3";

	qno[340] = "1341";
	question[340] = "你發覺後邊的車輛意欲超越(扒頭)時，你應該";
	a1[340] = "加速不讓對方扒頭";
	a2[340] = "立即靠左停車";
	a3[340] = "繼續向前慢駛";
	a4[340] = "";
	pic[340] = "0";
	ca[340] = "3";

	qno[341] = "1342";
	question[341] = "如有雙白線之行車線，較接近你車者為斷續白線，那是表示…";
	a1[341] = "安全之下可以扒頭";
	a2[341] = "不准扒頭 ";
	a3[341] = "不准右轉";
	a4[341] = "";
	pic[341] = "0";
	ca[341] = "1";

	qno[342] = "1343";
	question[342] = "在隧道內行駛時，是禁止使用…";
	a1[342] = "細燈";
	a2[342] = "高燈";
	a3[342] = "低燈";
	a4[342] = "";
	pic[342] = "0";
	ca[342] = "2";

	qno[343] = "1344";
	question[343] = "在甚麼情況下，車輛可在道路上亮起危險警告燈？";
	a1[343] = "夜間行車時，方便其他人看見";
	a2[343] = "壞車，或有阻礙其他的車輛";
	a3[343] = "該車只是臨時停泊";
	a4[343] = "";
	pic[343] = "0";
	ca[343] = "2";

	qno[344] = "1345";
	question[344] = "車輛在正常天氣，緊急情形下煞車，地面留下一條20米長的輪胎痕，當時之行車速度約為時速…";
	a1[344] = "40千米";
	a2[344] = "60千米";
	a3[344] = "80千米";
	a4[344] = "";
	pic[344] = "0";
	ca[344] = "2";

	qno[345] = "1346";
	question[345] = "在單線行車道上行駛，發覺後方車輛示意扒頭，你應該…";
	a1[345] = "立即加速向前駛";
	a2[345] = "駛入讓車處";
	a3[345] = "停車與對方理論";
	a4[345] = "";
	pic[345] = "0";
	ca[345] = "2";

	qno[346] = "1347";
	question[346] = "學習駕駛在甚麼情況下才可以在路上駕駛？";
	a1[346] = "指定時間內";
	a2[346] = "在有駕駛執照人仕陪同下";
	a3[346] = "在寂靜的地方街道上";
	a4[346] = "";
	pic[346] = "0";
	ca[346] = "1";

	qno[347] = "1348";
	question[347] = "法例規定私家車最少要安裝幾塊倒後鏡？";
	a1[347] = "一塊";
	a2[347] = "二塊";
	a3[347] = "三塊";
	a4[347] = "";
	pic[347] = "0";
	ca[347] = "2";

	qno[348] = "1349";
	question[348] = "在濕滑的路上駕駛必須增加…";
	a1[348] = "煞車距離";
	a2[348] = "輪胎氣壓";
	a3[348] = "汽油用量";
	a4[348] = "";
	pic[348] = "0";
	ca[348] = "1";

	qno[349] = "1350";
	question[349] = "駕駛時駕駛執照必須帶備在身…";
	a1[349] = "以便警員在有需要時查閱";
	a2[349] = "以便稍後親身交往警署";
	a3[349] = "因為可作身份證明文件使用";
	a4[349] = "";
	pic[349] = "0";
	ca[349] = "1";

	qno[350] = "1351";
	question[350] = "下列那種情況下可橫跨雙實線？";
	a1[350] = "超越前面車輛";
	a2[350] = "在安全情況下才可超越";
	a3[350] = "右邊有小路";
	a4[350] = "";
	pic[350] = "0";
	ca[350] = "3";

	qno[351] = "1352";
	question[351] = "路面濕滑時，你會？";
	a1[351] = "可慢速向前駛 ";
	a2[351] = "視察路面情況，適當時停車";
	a3[351] = "增加煞車距離一倍";
	a4[351] = "";
	pic[351] = "0";
	ca[351] = "3";

	qno[352] = "1353";
	question[352] = "路面白影斜線的作用是？";
	a1[352] = "保護轉右車輛的安全";
	a2[352] = "保護轉左車輛的安全";
	a3[352] = "全日禁止停車";
	a4[352] = "";
	pic[352] = "0";
	ca[352] = "1";

	qno[353] = "1354";
	question[353] = "滂沱大雨路面濕滑或有水浸，會導致你的車輛？";
	a1[353] = "轉向或煞車動作，可能完全失控 ";
	a2[353] = "電池系統損壞 ";
	a3[353] = "輪胎可能漏氣";
	a4[353] = "";
	pic[353] = "0";
	ca[353] = "1";

	qno[354] = "1355";
	question[354] = "在單程路上要右轉，你應？";
	a1[354] = "靠右轉右";
	a2[354] = "將車速提高至超越前車";
	a3[354] = "響號提示 ";
	a4[354] = "";
	pic[354] = "0";
	ca[354] = "1";

	qno[355] = "1356";
	question[355] = "正常環境下，隧道範圍內，車速不少於？";
	a1[355] = "25公里";
	a2[355] = "40公里";
	a3[355] = "60公里";
	a4[355] = "";
	pic[355] = "0";
	ca[355] = "1";

	qno[356] = "1357";
	question[356] = "法律規定車輛輪胎的胎紋深度不能少於？";
	a1[356] = "0.5毫米或以上";
	a2[356] = "1毫米或以上";
	a3[356] = "2毫米或以上";
	a4[356] = "";
	pic[356] = "0";
	ca[356] = "2";

	qno[357] = "1358";
	question[357] = "法律規定車輪胎紋起碼要蓋過輪胎面？";
	a1[357] = "二升一寬度";
	a2[357] = "四分三寬度";
	a3[357] = "五分四寬度";
	a4[357] = "";
	pic[357] = "0";
	ca[357] = "2";

	qno[358] = "1359";
	question[358] = "下列那項是正確？ ";
	a1[358] = "私家車乘客只須前座佩載安全帶 ";
	a2[358] = "手抱兒童放在膝上";
	a3[358] = "要確保輪胎有適量充氣";
	a4[358] = "";
	pic[358] = "0";
	ca[358] = "3";

	qno[359] = "1360";
	question[359] = "煞車距離是？";
	a1[359] = "發覺有危險時煞車到停定時間";
	a2[359] = "與前車保侍1個車位的距離";
	a3[359] = "車速在50公里以上";
	a4[359] = "";
	pic[359] = "0";
	ca[359] = "1";

	qno[360] = "1361";
	question[360] = "在高速公路上，巴士、中型及重型貨車，最高車速限制為？ ";
	a1[360] = "50公里";
	a2[360] = "70公里";
	a3[360] = "80公里";
	a4[360] = "";
	pic[360] = "0";
	ca[360] = "2";

	qno[361] = "1362";
	question[361] = "思考距離是？";
	a1[361] = "發覺視線受影響時";
	a2[361] = "前車司機向你發出手號時";
	a3[361] = "發覺有危險到煞車時間";
	a4[361] = "";
	pic[361] = "0";
	ca[361] = "3";

	qno[362] = "1363";
	question[362] = "危險警告燈只許下面那一個情況使用？ ";
	a1[362] = "壞車阻塞交通";
	a2[362] = "前面車速太快 ";
	a3[362] = "下著滂沱大雨 ";
	a4[362] = "";
	pic[362] = "0";
	ca[362] = "1";

	qno[363] = "1364";
	question[363] = "快速公路下著滂沱大雨，你應發出警告？";
	a1[363] = "將車停在一旁，直至停雨";
	a2[363] = "響號";
	a3[363] = "閃動車頭燈";
	a4[363] = "";
	pic[363] = "0";
	ca[363] = "3";

	qno[364] = "1365";
	question[364] = "當黃橙亮著時你應停車，除非？";
	a1[364] = "路口";
	a2[364] = "前面路面暢通無阻";
	a3[364] = "汽車當時亮著大燈";
	a4[364] = "";
	pic[364] = "0";
	ca[364] = "1";

	qno[365] = "1366";
	question[365] = "快速公路標誌是甚麼顏色";
	a1[365] = "藍色";
	a2[365] = "綠色";
	a3[365] = "紅色";
	a4[365] = "";
	pic[365] = "0";
	ca[365] = "2";

	qno[366] = "1367";
	question[366] = "當你經過路口黃色交通燈亮著時，你必須停車，除非接近？";
	a1[366] = "行人過路線 ";
	a2[366] = "從後車輛速度太快";
	a3[366] = "雙白線";
	a4[366] = "";
	pic[366] = "0";
	ca[366] = "1";

	qno[367] = "1368";
	question[367] = "向上斜坡泊車，熄匙後須入什麼『波檔』？";
	a1[367] = "須入『一檔』";
	a2[367] = "須入『空檔』";
	a3[367] = "須入『倒後波檔』";
	a4[367] = "";
	pic[367] = "0";
	ca[367] = "1";

	qno[368] = "1369";
	question[368] = "向下斜坡泊車，熄匙後須入什麼『波檔』？";
	a1[368] = "須入『一檔』";
	a2[368] = "須入『空檔』";
	a3[368] = "須入『倒後波檔』";
	a4[368] = "";
	pic[368] = "0";
	ca[368] = "3";

	qno[369] = "1370";
	question[369] = "在隔車路行駛時，須選用那種方法掉頭？";
	a1[369] = "在沒有對頭車行駛時 ";
	a2[369] = "響號及從速超越扒頭";
	a3[369] = "選擇在下一路口掉頭";
	a4[369] = "";
	pic[369] = "0";
	ca[369] = "3";

	qno[370] = "1371";
	question[370] = "在何種情況下不宜駕駛？";
	a1[370] = "飲酒或服藥後";
	a2[370] = "天文台懸掛3號風球";
	a3[370] = "在車箱內吸煙";
	a4[370] = "";
	pic[370] = "0";
	ca[370] = "1";

	qno[371] = "1372";
	question[371] = "駛達路口交通燈由綠轉黃，駕駛者應避免將車輛停於……?";
	a1[371] = "黃色行人過路線 ";
	a2[371] = "接近避車處";
	a3[371] = "馬路邊行人路上";
	a4[371] = "";
	pic[371] = "0";
	ca[371] = "1";

	qno[372] = "1373";
	question[372] = "輪胎在同一車軸，怎樣會構成違法？";
	a1[372] = "輪胎充氣不平均";
	a2[372] = "輪胎蟬絲未完全與車身鎖緊";
	a3[372] = "在同一車輛用不規格之輪胎";
	a4[372] = "";
	pic[372] = "0";
	ca[372] = "3";

	qno[373] = "1374";
	question[373] = "什麼情況下可從左方超車(扒頭)？";
	a1[373] = "在單程路上或將在前左轉";
	a2[373] = "道路上有維修工程";
	a3[373] = "其他司機向你發出手號 ";
	a4[373] = "";
	pic[373] = "0";
	ca[373] = "1";

	qno[374] = "1375";
	question[374] = "前面交通管制標誌表示什麼？";
	a1[374] = "前面有人手操作臨時『停/去』訊號";
	a2[374] = "前路受阻應該掉頭";
	a3[374] = "前路斑馬線";
	a4[374] = "";
	pic[374] = "0";
	ca[374] = "1";

	qno[375] = "1376";
	question[375] = "那一種滑胎(跣胎)是最危險？";
	a1[375] = "路面油瀆";
	a2[375] = "天雨路滑";
	a3[375] = "不論任何滑胎皆有危險";
	a4[375] = "";
	pic[375] = "0";
	ca[375] = "3";

	qno[376] = "1377";
	question[376] = "如果你看見前車發出『右轉』迅號時，你將會？ ";
	a1[376] = "響號提示前車";
	a2[376] = "亮起大燈提示";
	a3[376] = "減低行車速度";
	a4[376] = "";
	pic[376] = "0";
	ca[376] = "3";

	qno[377] = "1378";
	question[377] = "駕駛人士在駕駛期間發覺疲倦應怎辦？";
	a1[377] = "將車速盡量減慢及靠左繼續行駛";
	a2[377] = "停車休息";
	a3[377] = "開著車內音響，保持清醒";
	a4[377] = "";
	pic[377] = "0";
	ca[377] = "2";

	qno[378] = "1379";
	question[378] = "駕車下斜坡，駛近障礙物時，迎面有車輛駛來，你將會......？";
	a1[378] = "亮起大燈提示迎面車輛";
	a2[378] = "響號提示";
	a3[378] = "讓迎面車輛先通過 ";
	a4[378] = "";
	pic[378] = "0";
	ca[378] = "3";

	qno[379] = "1380";
	question[379] = "在甚麼情況下，車輛可在道路上亮起危險警告？ ";
	a1[379] = "超越前車(扒頭)";
	a2[379] = "壞車，或有阻礙其他的車輛 ";
	a3[379] = "於路邊停車等候";
	a4[379] = "";
	pic[379] = "0";
	ca[379] = "2";
	// set first Question
	setq(selected[question_no - 1]);
}
